{"recipes": [{"id": "67282bf843745626ae1771a7", "title": "Protein Bites", "ingredients": ": 1 cup oats 1/3 cup coconut flakes 1/2 cup ground flaxseed 1/2 cup chocolate chips 2 scoop protein powder 1/2 cup peanut butter 1/3 cup honey 1 teaspoon vanilla extract Other fun add ins: chia seeds, dried cherries, m&amp;ms, cinnamon, pumpkin, sunflower seeds, raisins, cocoa powder", "directions": ": 1. Mix wet ingredients in a large bowl. 2. Add dry ingredients and mix until thick dough like consistency. 3. If dough is flakey, add milk 1 TBSP at a time until dough it slightly sticky. 4. Roll into balls. 7. Refrigerate and enjoy!", "category": "snack", "macros": {"calories": 550, "protein": 35, "carbs": 55, "fat": 10}}, {"id": "67424dcd4806e80a7abe0816", "title": "Maple Dijon Chicken", "ingredients": ":", "directions": ": Mix ingredients to make sauce Pour sauce over chicken in air tight container. Marinate chicken in fridge for 2-4 hours or overnight Add potatoes and green beans to pan and cover with olive oil, salt, and pepper. Add marinated chicken to pan. Bake for 30 mins at 400 degrees Fahrenheit or until chicken reaches internal temperature of 165 degrees Fahrenheit. Separate into 4-5 servings and store in fridge.", "category": "dinner", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "676df42bb017e94a8536ad4c", "title": "Butternut Squash Mac", "ingredients": ": 1 butternut squash 1/2 c nutritional yeast 1/4 c bone broth 6 stalks of green onion 1 tsp pepper 1 tsp salt (for non-IBS individuals) 1 head of garlic 150g of gluten free pasta 1 lb. 97% lean ground beef", "directions": ": Cut squash in half and roast squash for 45 minutes at 400 degrees F or until mushy. Let cool. (If you plan to add head of garlic, roast in oven with squash). Scoop out inside contents of squash and add to blender cup. Add nutrition yeast, broth, chopped green onion, and spices to blender. Blend until smooth. Pour over cooked beef and serve over pasta. For individuals with IBS, butternut squash is not a low FODMAP food however, it is considered to be low FODMAP when consumed in quantities less than approximately 2.65oz and can be tolerated in moderation. Note: garlic is also a high FODMAP food and should not be added if meal preparation is for individuals with IBS. Please note, individuals with IBS tolerate foods on a case by case basis and should work with a dietitian to determine specific dietary needs.", "category": "dinner", "macros": {"calories": 500, "protein": 35, "carbs": 30, "fat": 25}}, {"id": "676f497158b82e752b9143dc", "title": "Candied Cranberries", "ingredients": ": 1 bag of fresh cranberries sparkling lemon or lime beverage of choice 3/4 c coconut sugar", "directions": ": Soak cranberries in sparkling beverage for 24 hours. Drain liquid from cranberries. Add coconut sugar and shake in container until all berries are coated. Place coated cranberries on sheet pan and bake for 8 minutes at 200 degrees F. Remove from oven. Let cool for 5 minutes. Place in freezer for 15 minutes. Throw into a serving dish and enjoy! This recipe is gluten and dairy free and can be made refined sugar free based on beverage selected. For refined sugar free options, choose mineral water and fresh lemon or lime juice! For a sweeter taste, sub powdered sugar for coconut sugar!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "676f4ef7ce70df2eea39f89c", "title": "Gingerbread Baked Oats", "ingredients": ": 1/3 c oat milk (sub almond) 1 scoop vanilla protein or collagen 1/2 c oats 1 egg 1/2 tsp baking powder 1/2 tsp vanilla 2 TBSP maple syrup 1/2 tsp ginger 1 tsp all spice 1/2 tsp nutmeg 1/2 tsp salt", "directions": ": Preheat oven to 350 degrees F. Blend all ingredients in blender. Pour into oven safe dish. Bake at 350 degrees F for 25-30 mins. This recipe is gluten and dairy free. To make IBS friendly/low FODMAP, sub almond milk for oat milk.", "category": "breakfast", "macros": {"calories": 450, "protein": 15, "carbs": 55, "fat": 10}}, {"id": "676f529ea934c9553beee9a5", "title": "Sugar Cookie Matcha Latte", "ingredients": ": 2 tsp (approx 3 g) matcha powder mixed with 35g hot water 140 mL (approx 2/3 c)almond milk 1/2 tsp Almond extract 1/2 tsp vanilla extract 2 tsp Maple syrup Sprinkles (optional for rim)", "directions": ": Heat 35g of water. Combine with 3g (approx 2 tsp) of matcha. Froth or whisk. Add maple syrup, almond extract, and vanilla extract to mixture. Froth or whisk. Scoop ice into sprinkle lined serving cup. Pour milk of choice over ice. Add in matcha mixture. Stir and enjoy.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}, {"id": "6773e18176b1b81d441e4a26", "title": "Roasted Maple Carrots", "ingredients": ": 1 bag of large carrots 3 TBSP Olive oil 3 TBSP Maple syrup 1 TBSP oregano 2 tsp Salt 1 tsp cinnamon 1 tsp thyme 1/2 tsp ginger", "directions": ": Peel and slice carrots. Coat in olive oil and maple syrup. Toss in seasonings. Spread seasoned carrots onto baking pan. Roast for 30 mins at 400 Degrees F", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6773e6a79d79be40f0b841b5", "title": "Sugar Cookie Protein Balls", "ingredients": ": 2 serving collagen powder 1 serving vanilla protein powder 1/2 tsp all spice 1/2 tsp salt 1/4 c almond flour 1 tsp vanilla extract 1 tsp almond extract 1/4 c almond butter 1 TBSP maple syrup 2 TBSP soy milk Topping: Sprinkles", "directions": ": Mix all ingredients in bowl until thick (cookie dough-like) consistency. Roll into balls. Dip dough balls into sprinkle and cover completely. Store in fridge and enjoy!", "category": "dessert", "macros": {"calories": 550, "protein": 35, "carbs": 50, "fat": 15}}, {"id": "6774002d0f1dd043b4aaeb4e", "title": "Egg Nog French Toast", "ingredients": ": 3 slices bread (Dave's Killer Powerseed used in Cronometer; opt for Gluten free bread if needed) 1/2cup oat nog 1/3 cup egg whites 1 serving collagen 1 tsp nutmeg 1 Stevia packet 1/2 tsp Cinnamon", "directions": ": Slice bread into cubes. Mix egg whites, oat nog, spices, collagen, and stevia in a bowl. Place cubed bread into oven safe dish. Pour liquid mixture over bread. Bake at 400 degrees F for approximately 20 minutes or until lightly browned. Top with nutmeg and syrup!", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67744e05dbf530080f283fa1", "title": "Sugar Cookie Whip Dip", "ingredients": ": 1/2 cup Coconut Whipped Topping 1 serving plant based vanilla protein powder 1 tsp almond extract Topping: as many sprinkles as the heart desires", "directions": ": Mix coco whip, protein powder, and almond extract in bowl. Top with sprinkles. Dip your favorite cookie or dessert or eat it by the spoonful. Triple the recipe, and it is also a great high protein dessert dip for parties!", "category": "dessert", "macros": {"calories": 550, "protein": 35, "carbs": 50, "fat": 15}}, {"id": "67744ed0fe5d8014be06f1b3", "title": "Strawberry Santa Hats", "ingredients": ": Strawberries Oreo sandwich cookies or Trader Joe Joe’s if Gluten Free White chocolate Powdered sugar", "directions": ": Melt white chocolate in microwave. Heat in 30 second increments, stirring between each round until fully melted. Dip sandwich cookies in melted white chocolate. Make sure to cover both sides of cookies. Place a single strawberry immediately on top of dipped cookie. Scrap filling from one sandwich cookie and roll into balls for Santa hat topper. Top strawberry with ball of cream filling. Let cool in freezer for 10-15 minutes. Sprinkle with powder sugar and enjoy. #dessert #snack #glutenfree #seasonal #holiday #winter Instagram Reel", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67744f8789df4e73758bec96", "title": "Single Serve Hot Cocoa Protein Pancakes", "ingredients": ": 1 banana (115g) 3 TSBP Oats 110 g egg whites 1 scoop chocolate protein powder 1/4 tsp baking soda 1/4 tsp salt Optional Toppings: Marshmallows Maple syrup (Toppings not included in Cronometer recipe)", "directions": ": Blend ingredients in blender. Heat non-stick pan on low. Spoon batter onto pan, making pancakes of desired size. Flip pancakes when batter starts to bubble. Finish cooking to desired texture. This recipe is gluten and dairy free. Make this recipe IBS Friendly by using a firm (yellow-green) banana. If using vanilla protein powder, add 2 TBSP cocoa powder to blender!", "category": "breakfast", "macros": {"calories": 700, "protein": 35, "carbs": 75, "fat": 15}}, {"id": "6776e155c6828404bfb6a607", "title": "Instant Pot Chili", "ingredients": ": 1 yellow onion, chopped&nbsp; 3 cloves garlic, finely chopped&nbsp; 2 Tbsp tomato paste 2 lbs lean ground beef 2 cups beef bone broth 1 (15-oz.) can black beans, rinsed, drained 1 (15-oz.) can fire-roasted diced tomatoes 1 (15-oz.) can kidney beans, rinsed, drained 1 (15-oz.) can black eyed peas, rinsed, drained 1.5 Tbsp chili powder 1 tsp. dried oregano&nbsp; 1 tsp. ground cumin&nbsp; 1/2 tsp. cayenne Kosher salt Freshly ground black pepper Optional Toppings: Shredded cheddar cheese Sour cream or Greek yogurt for a high protein/low fat sub Fritos or corn chips Chopped green onions (Toppings not included in Cronometer recipe)", "directions": ": Sauté: Set Instant Pot to Sauté and cook onion, garlic, and ground beef until browned (5-7 minutes). If using ground beef with higher fat content, you may want to drain the fat. With ~93% lean beef, draining isn't necessary. Add Ingredients: Return the ground beef mixture to the pot. Add black beans, tomatoes, kidney beans, black-eyed peas, bone broth, spices, salt, and pepper. Lock the lid and Pressure Cook on High for 14 minutes. Release Pressure: Perform a quick pressure release, then open the lid once fully released. Serve: Divide chili into bowls and top with your favorite toppings. For Slow Cooker: Cook beef in a skillet, then transfer it along with all other ingredients to a slow cooker. Cook on Low for ~6 hours or High for ~3 hours.", "category": "dinner", "macros": {"calories": 700, "protein": 57, "carbs": 30, "fat": 35}}, {"id": "6786d2f7bf52fe710e1b5694", "title": "Meal Prep Breakfast Burritos", "ingredients": ": 6 large tortillas (whole wheat or low-carb options for extra fiber) 6 large eggs 1 cup egg whites 1 cup shredded cheese (cheddar, Monterey Jack, Mozzarella, or your favorite variety) 1 lb ground turkey sausage 1/2 tsp salt 1/2 tsp black pepper 1/2 tsp paprika 1/4 tsp garlic powder Cooking spray or 1 tsp olive oil", "directions": ": Cook the Turkey Sausage Heat a skillet over medium heat. Spray with cooking spray. Add turkey sausage and cook until browned and fully cooked, about 8–10 minutes. Season with smoked paprika and garlic powder. Set aside. Prepare the Eggs In a mixing bowl, whisk together eggs and egg whites with salt and pepper. In the same skillet (wipe clean if needed), lightly spray with cooking spray and pour in the egg mixture. Cook on low-medium heat, stirring gently to create soft scrambled eggs. Remove from heat. Combine the eggs, turkey sausage, and cheese in a bowl. Stir to combine. Assemble the Burritos Lay out each tortilla. Add a portion of the mixture (~3/4-1 cup) to the center of each tortilla. Wrap the Burritos Fold the sides of the tortilla over the filling, then roll tightly from bottom to top to form a burrito. Repeat with all tortillas. Optional: Briefly brown the seam-side of each burrito in the skillet to help seal it shut. Store for Meal Prep Fridge : Wrap each burrito in foil or parchment paper and store in an airtight container. Refrigerate for up to 5 days. Freezer : Wrap burritos individually in plastic wrap, then foil, and place them in a freezer bag. Freeze for up to 3 months. Reheat Before Eating From the fridge: Microwave for 1–1:30 minutes, flipping halfway. From the freezer: Microwave for 3–4 minutes, flipping halfway. These burritos are great on their own or dipped in salsa. You can pair them with fresh fruit for a complete breakfast. Need extra calories? Swap egg whites for whole eggs, add more cheese, or mix in veggies like sautéed bell peppers or spinach. Enjoy your delicious, protein-packed breakfast burritos!", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "679250f91b90be6ae23eb1fa", "title": "Pomegranate Raspberry Fizz", "ingredients": ": 2 oz pomegranate juice 2 oz soda water 3 raspberries (plus extra for garnish) 1 sprig rosemary Ice", "directions": ": Rim the coupe glass with rosemary and chill if desired. Muddle raspberries with pomegranate juice in a shaker. Add ice, shake, and strain into the glass. Top with soda water. Garnish with raspberries and a rosemary sprig. Pro Tip : For extra flair, you can lightly torch the rosemary sprig before garnishing to enhance its aroma. Cheers! Enjoy your refreshing mocktail!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "679a79b5eb43e94cdd6ef650", "title": "Valentine's Protein Bites", "ingredients": ": ½ cup quick oats 1/4 cup ground flaxseed 1 scoop protein powder 1 scoop collagen 1/2 cup peanut butter 1/4 cup honey 1 TBSP unsweetened almond milk (see note) 42g Valentine’s colored M&amp;Ms Other fun add ins: chia seeds, dried cherries, cinnamon, pumpkin, sunflower seeds, raisins, cocoa powder", "directions": ": 1. Mix wet ingredients in a large bowl. 2. Add dry ingredients and mix until thick dough like consistency. 4. Roll into balls. 7. Refrigerate and enjoy! Note: If dough is dry or flakey, add milk 1 TBSP at a time until dough it is slightly sticky.", "category": "snack", "macros": {"calories": 550, "protein": 35, "carbs": 55, "fat": 10}}, {"id": "679ce23b73d25c617a51e6e1", "title": "Chocolate Covered Strawberries", "ingredients": ": 1 pint fresh strawberries, washed and dried thoroughly 6-8 oz dark chocolate melting wafers Optional toppings: crushed nuts, shredded coconut Other fun add ins: chia seeds, dried cherries, cinnamon, pumpkin, sunflower seeds, raisins, cocoa powder", "directions": ": 1. Prep: Line a baking sheet with parchment or waxed paper. Place toppings on small plates if using. Melt Chocolate: Using a double boiler or microwave in 30-second intervals, stirring in between, melt the chocolate until smooth. Dip: Hold each strawberry by the stem, dip into the melted chocolate, and twist slightly to remove excess. If using toppings, dip immediately before placing on the baking sheet. Drizzle (Optional): Drizzle leftover chocolate with a fork over the dipped strawberries. Can also opt to use a different chocolate (white or milk) for drizzle. Set: Chill in the refrigerator for about 15 minutes until the chocolate hardens. Enjoy! Store in a cool place and enjoy within 24 hours for the best taste.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}, {"id": "679d1dedebf2aa6b1de6d8b3", "title": "Mediterranean Chicken Shawarma Bowls", "ingredients": ":", "directions": ": Marinate Chicken: In a bowl, mix oil, spices, and salt. Add chicken, toss to coat, and marinate for 30 minutes (or up to 3 hours in the fridge). Cook Rice: In a pot, bring rice, salt, and 3 cups water to a boil. Cover, reduce heat, and simmer for 15 minutes. Let sit for 10 minutes, then fluff with a fork. Cook Chicken: Spray the pan with oil and heat over medium-high heat. Cook chicken for 5-7 minutes per side until golden brown and 165°F internally. Let rest for10 minutes, then slice. Make Salad: In a bowl, combine cucumbers, bell peppers, onion, tomatoes, and feta. Add red pepper flakes, juice from 1 lemon, and 2 tsp. oil. Toss and season with salt. Assemble Bowls: Divide rice among bowls. Top with chicken, salad, a 1 TBSP of tzatziki sauce, 1 TBSP hummus. Serve with pita.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "679d1eabffb21e4ef5af76da", "title": "Slow-Cooker Korean Beef Rice Bowls", "ingredients": ":", "directions": ": In a 6-quart slow cooker, whisk together ginger, garlic, broth, brown sugar, soy sauce, gochujang, sesame oil, vinegar, and cornstarch. Add beef to the slow cooker and mix to coat. Cover and cook on high for 5-6 hours until beef is tender. Turn off slow cooker and let cool for 15 minutes. Skim excess fat from the surface, then stir the sauce. Shred beef with two forks and mix to combine. In a pot, bring rice, salt, and 4 cups water to a boil. Cover, reduce heat, and simmer for 15 minutes. Let sit for 10 minutes, then fluff with a fork. Serve: Spoon beef and sauce over cooked rice. Top with scallions, cilantro, and sesame seeds. Optional: Serve with steamed or roasted broccoli for added fiber, nutrients, and a well balanced meal", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "679d368c11bec651ddcb4df2", "title": "Deconstructed Burger Bowls", "ingredients": ":", "directions": ": Heat a skillet over medium-high heat. In a bowl, mix the ground beef with the spices until well combined. Then, form the mixture into four equal burger patties. Cook the patties for about 3-4 minutes per side, or until fully cooked through. Alternatively, you can cook the beef as crumbles by browning it in the skillet, breaking it up as it cooks. While the beef is cooking, prepare the special sauce by whisking all the ingredients together in a small bowl until well combined. Assemble the burger bowls by layering romaine lettuce as the base, followed by the cooked burger patties (or crumbled beef) and toppings of your choice. Drizzle the special sauce over everything and enjoy! Serving Suggestion: This dish pairs perfectly with roasted potatoes or homemade potato fries for a delicious and satisfying meal.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67ab628eebcbb403ed0d02de", "title": "Sheet Pan BBQ Chicken with Roasted Veggies", "ingredients": ":", "directions": ": Preheat oven to 400°F (200°C) and line a sheet pan with parchment paper. Mix BBQ sauce, olive oil, and seasonings in a bowl. Coat the chicken and set aside. Toss sweet potatoes with olive oil, salt, and garlic powder. Spread on the sheet pan and roast for 15 minutes. Remove the pan, place the chicken in the center, and add broccoli and bell pepper tossed with olive oil, salt, and pepper. Roast Everything Together for 20-25 minutes until the chicken reaches 165°F, sweet potatoes are tender, and veggies are slightly charred. Let the chicken rest for 5 minutes, then slice. Drizzle with extra BBQ sauce, garnish, and serve with lemon wedges. Great for meal prep with a side of quinoa, brown rice, or extra greens!", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67ab65395dc8a56df6fc5431", "title": "Avocado Cucumber Salad", "ingredients": ": 2 avocados, chopped 2 small cucumbers, diced 1/2 cup crumbled feta cheese 1/2 cup fresh cilantro, chopped 2 green onions thinly, sliced 1 TBSP olive oil juice from 1 lemon 1 tsp salt", "directions": ": In a medium bowl, combine the avocados, cucumbers, feta, cilantro, and green onions. Add the olive oil and lemon juice and toss gently to mix. Season with salt.", "category": "lunch", "macros": {"calories": 550, "protein": 22, "carbs": 30, "fat": 35}}, {"id": "67b34fd549a09458d51e677b", "title": "Slow-Roasted Salmon Quinoa Bowl", "ingredients": ":", "directions": ": Preheat oven to 275°F (135°C) and line a baking sheet with parchment paper. Place salmon fillets on the baking sheet, drizzle with olive oil, and season with salt, pepper, garlic powder, and smoked paprika. Top salmon with lemon slices and slow roast for 30–35 minutes until tender and flaky. In a small bowl, mix vinegar, salt, and sugar until dissolved. Add cucumber slices and let sit for at least 15 minutes. In another bowl, whisk together Greek yogurt, dill, lemon juice, garlic, and olive oil. Thin with water if needed and season with salt and pepper. Divide cooked quinoa or rice into 4-5 bowls. Top with salmon, pickled cucumbers, red onion, and avocado. Drizzle with creamy dill dressing and garnish with fresh dill or lemon wedges if desired.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67b750547d6e2c08347da2f1", "title": "Sheet Pan Garlic Shrimp and Roasted Veggies", "ingredients": ": 1 lb shrimp, peeled and deveined 2 yellow onions, peeled and sliced 2 cups broccoli florets 2 red bell peppers, thinly sliced Lemon (for serving) 1/4 cup avocado oil 2 TBSP minced garlic 1 tsp. crushed red pepper flakes Salt to taste Ground black pepper to taste", "directions": ": Preheat oven to 400°F (200°C) and line a sheet pan with parchment paper. Mix in a medium size bowl avocado oil, garlic, red pepper flakes, parsley, salt and pepper. Toss in shrimp and set aside to marinate. Toss onions, broccoli, and red peppers with a drizzle or spray of avocado oil and season with salt and pepper. Spread on the sheet pan and roast for 20 minutes. Remove the pan, pour shrimp and marinade over roasted veggies. Spread out in a single layer and roast for an additional 5 minutes or until shrimp is pink. If shrimp are still slightly frozen roast longer ~10min. Serve with a lemon wedge. Great for meal prep with a side of whole wheat pasta, brown rice, quinoa, or greens.", "category": "breakfast", "macros": {"calories": 450, "protein": 15, "carbs": 30, "fat": 25}}, {"id": "67c5f57354b52f4c45d08c9c", "title": "Grilled BBQ Chicken Bowls", "ingredients": ":", "directions": ": In a bowl, mix olive oil, BBQ sauce, garlic powder, paprika, salt, and pepper. Coat the chicken evenly and let it marinate for at least 15 minutes. Preheat the grill to medium-high heat. Grill the chicken for 6-8 minutes per side until fully cooked (internal temperature of 165°F). Let it rest for 5 minutes before slicing. In a large bowl, whisk together Greek yogurt, apple cider vinegar, Dijon mustard, salt, and pepper. Add the shredded cabbage and mix until well coated. Divide the cooked rice among five containers (1/2 cup per container) Top each with sliced BBQ chicken, a scoop of coleslaw, and sliced pickles. Drizzle with extra BBQ sauce if desired.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67d18ee4aa74ea1ca1d57104", "title": "Harissa Roasted Chicken & Sweet Potatoes", "ingredients": ": 2 lb. boneless skinless chicken thighs Kosher salt &amp; black pepper 3 Tbsp. harissa Juice of ½ lemon 2 cloves garlic, minced 3 large sweet potatoes, sliced 1 red onion, sliced 2 Tbsp. olive oil 1 tbsp. ground cumin Fresh cilantro &amp; lemon wedges for serving", "directions": ": Season chicken with salt &amp; pepper. Mix with harissa, lemon juice, and garlic. Let sit. Toss sweet potatoes &amp; onion with oil, cumin, salt &amp; pepper. Spread on a baking sheet &amp; bake at 425°F for 10-15 min. Nestle chicken into the veggies &amp; bake for another 20-25 min until chicken reaches 165°F. Top with cilantro &amp; serve with lemon wedges.", "category": "dessert", "macros": {"calories": 600, "protein": 40, "carbs": 60, "fat": 10}}, {"id": "67d871e857ca2672c59159a9", "title": "Lemon Chicken Orzo Salad", "ingredients": ":", "directions": ": Whisk all dressing ingredients together in a small bowl. Season &amp; cook chicken (grill, pan-sear, or bake) until done. Let rest, then chop. Cook orzo and drain. Add veggies, feta, olives, &amp; herbs to the bowl. Add dressing and toss to combine. Top with chicken. Serve warm or chilled with fresh lemon wedges.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67e6abde31e1636b51eb181a", "title": "Sheet Pan Chicken Fajitas", "ingredients": ": 1 lb chicken breast, cut into strips 3 bell peppers (any color), cut into strips 1 red onion, cut into strips Avocado oil (spray or drizzle) 1 tsp salt ½ tsp black pepper 1 tsp paprika 1 tsp onion powder 1 tsp garlic powder", "directions": ": Preheat oven to 400°F (200°C). Spread chicken, bell peppers, and onion evenly on a sheet pan. Lightly coat with avocado oil and season with salt, pepper, paprika, onion powder, and garlic powder. Toss to coat evenly. Bake for 20-25 minutes, flipping halfway through, until chicken is fully cooked and veggies are tender. Serve with tortillas, rice, or on top of a salad! Add any of your favorite taco toppings/ avocado, salsa, cilantro, roasted corn, pickled onions, shredded cheese, fresh lime", "category": "dinner", "macros": {"calories": 600, "protein": 40, "carbs": 30, "fat": 25}}, {"id": "67f415fa86dbec59bcf5fcb8", "title": "Tropical Grill Kabobs", "ingredients": ": 1 lb chicken breast , cut into 1.5-inch chunks 1 lb steak (sirloin or flank), cut into 1.5-inch chunks 1 red bell pepper , cut into 1.5-inch pieces 1 yellow bell pepper , cut into 1.5-inch pieces 1 red onion , cut into 1.5-inch wedges 1 ½ cups pineapple chunks (fresh or canned in juice) Wooden skewers (about 10–12)", "directions": ": Soak the wooden skewers in water for at least 30 minutes to prevent burning on the grill. In a large bowl or zip-top bag , whisk together all marinade ingredients. Add the chicken, steak, bell peppers, onion, and pineapple to the marinade. Toss to coat evenly. Cover and marinate in the fridge for at least 1 hour , or up to 8 hours for deeper flavor. Preheat the grill to medium-high heat. Thread the marinated ingredients onto the soaked skewers , alternating between chicken, steak, veggies, and pineapple for a colorful presentation. Grill the kabobs for 10–15 minutes, turning every few minutes, until the chicken is fully cooked (165°F internal temp) and the steak reaches desired doneness. Remove from grill and let rest for a few minutes before serving. Serve over rice, quinoa, or with a side salad for a fresh summer meal. These kabobs are great for meal prep or BBQ gatherings!", "category": "dinner", "macros": {"calories": 650, "protein": 60, "carbs": 30, "fat": 25}}, {"id": "67fd416fe836cd766f950c6a", "title": "Hashbrown Egg Casserole with Feta, Spinach & Sundried Tomatoes", "ingredients": ": 12 large eggs 3 cups frozen hashbrowns , thawed 1 block feta cheese , cubed 2 cups fresh spinach , chopped ½ cup sundried tomatoes , chopped (drained if oil-packed) 1 small onion , diced Salt and pepper , to taste Olive oil or cooking spray , for greasing", "directions": ": Preheat oven to 425°F . Grease a 9x13-inch baking dish (or use two smaller ones if needed). spread the thawed hash brown in the bottom. If still frozen bake for ~5-10 minutes. In a large mixing bowl, whisk the 12 eggs thoroughly. Add salt, pepper, and any optional seasonings. Pour over hashbrowns. Top with feta, spinach, sundried tomatoes, and diced onion . Bake for 20-30 minutes , or until the eggs are set. Let cool for 10 minutes before slicing and serving.", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "680bc9cb6bb6837ac0abc7b1", "title": "Slow Cooker Pork Carnitas", "ingredients": ": 2 pounds pork tenderloin or pork loin 1 tablespoon dried oregano 2 teaspoons ground cumin 1 tablespoon avocado oil ½ onion, chopped 3 garlic cloves, smashed 1 medium jalapeño, sliced (remove seeds for less heat) 2 teaspoons salt 2 tablespoons fresh lime juice ¼ cup orange juice", "directions": ": Assemble in slow cooker: Place the pork loin in the slow cooker. Add oregano, cumin, avocado oil, onion, garlic, jalapeño, salt, lime juice, and orange juice. Mix: Use tongs or clean hands to gently mix everything together, making sure the pork is coated evenly with the seasonings and juices. Cook: Cover and cook on HIGH for 4–6 hours or LOW for 6–8 hours , until pork is very tender and reaches an internal temp of 195°F . Shred: Shred the pork directly in the slow cooker using two forks. Stir to mix with the juices. Serve or store: Serve immediately, or let cool and store pork with juices in an airtight container in the fridge until ready to eat.", "category": "dinner", "macros": {"calories": 450, "protein": 15, "carbs": 30, "fat": 25}}, {"id": "682c978992d64461b5f10edf", "title": "High Protein Chocolate Mousse", "ingredients": ": 1 container (16oz) cottage cheese 2% fat 1 scoop chocolate protein powder 2 TBSP unsweetened cocoa powder ¼ cup semi sweet chocolate chips, melted", "directions": ": In a food processor or blender, combine all ingredients until smooth. Make sure chocolate chips are melted prior to mixing.", "category": "dessert", "macros": {"calories": 650, "protein": 42, "carbs": 50, "fat": 25}}, {"id": "671a8caff5a0a972a9c5b12f", "title": "Broccoli Cheddar Egg Muffins", "ingredients": ": 1 cup broccoli, chopped 1/4 cup diced onion 5 slices of turkey bacon 8 eggs 1/2 cup low fat shredded cheese 1 tbsp olive oil 1/2 tsp garlic powder 1/4 tsp salt 1/4 tsp pepper", "directions": ": Preheat the oven to 400 ° F. Cook turkey bacon according to package instructions and then cut up into small pieces. Add olive oil, broccoli, onion, salt, garlic powder, and pepper to a pan and sauté over medium heat. In a bowl, whisk the eggs, bacon, and cheese. Pour pan contents into the bowl and mix throughly. In a six count muffin tin, distribute mix evenly and bake for 15-20 minutes or until completely cooked.", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a8dd67dfdf95e57d907d8", "title": "Tater Tot Breakfast Casserole", "ingredients": ": 1 lb. turkey sausage 1.5 cups egg whites 1.5 cup low fat cottage cheese 6 servings of tater tots (504 g) 1/2 cup shredded cheddar cheese 1/2 tsp salt 1/2 tsp pepper 1/2 tsp garlic powder", "directions": ": Preheat oven to 375 ° F degrees. Spray a casserole dish with cooking grease and set aside. Heat a skillet over medium-high heat. Brown turkey sausage and drain excess grease from skillet. Set aside. In a blender, add egg whites, cottage cheese, and seasonings. Blend until creamy. Pour the blended egg mixture into the bottom of the greased casserole dish and add the cooked turkey sausage. Sprinkle ½ of the cheese across the top. Evenly distribute the tater tots across the top of the casserole and add the remaining cheese. Bake at 375 ° F for 40 mins.", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a8f2c30da9777e243354b", "title": "Shrimp and Broccoli Stir Fry", "ingredients": ": 1 lb. shrimp, peeled and deveined 2 tbsp olive oil 2 tbsp agave or honey 2 tbsp reduced sodium soy sauce 1/2 tsp ginger 1 tbsp minced garlic 2 cups broccoli 2 cups brown rice", "directions": ": In a bowl, mix olive oil, agave, soy sauce, ginger, and minced garlic. Marinade shrimp in the sauce for 20 minutes. Steam broccoli and cook rice, set both aside. In a large skillet on medium high heat, pour shrimp and sauce into pan and sear for 2 minutes on each side. Add broccoli and rice and reduce heat to low. Cover and let sear for 5 minutes or until all sauce has been absorbed. Enjoy!", "category": "lunch", "macros": {"calories": 500, "protein": 15, "carbs": 75, "fat": 10}}, {"id": "671a9029740cc74a2e8a392e", "title": "Buffalo Chicken Casserole", "ingredients": ": 30 oz. chicken (cooked) 30 oz. frozen riced cauliflower 1/3 cup Primal Kitchen buffalo sauce 1 packet ranch seasoning 2 cups shredded cheese 8 oz reduced fat cream cheese", "directions": ": Preheat oven to 350 ° F. Microwave riced cauliflower according to package instructions. Combine all ingredients, including cooked cauliflower, in a large bowl and mix. Pour mixture into a casserole dish and bake for 35 minutes.", "category": "dinner", "macros": {"calories": 750, "protein": 47, "carbs": 75, "fat": 20}}, {"id": "671a918a6aa643149026f5f0", "title": "Southwest Chicken Salad", "ingredients": ": 24 oz. chicken tenderloins 1 cup black beans 1 cup red bell peppers 1 cup chickpeas 1 cup corn 1 cup cucumber, chopped 1 cup cooked shallot 1 cup jalapeno peppers, chopped 1 tbsp cilantro 1 cup low-fat shredded cheese 2 tbsp Primal Kitchen cilantro lime dressing 2 cups lettuce", "directions": ": Cook chicken, black beans, chickpeas, and shallots prior to assembling salad. Chop peppers and onions. In a large bowl, add cooked ingredients and chopped vegetables to lettuce. Toss with Primal Kitchen cilantro lime dressing.", "category": "lunch", "macros": {"calories": 550, "protein": 47, "carbs": 30, "fat": 20}}, {"id": "671a935ce5d7fa7996e0b622", "title": "Cheeseburger Wrap", "ingredients": ": 1 lb. 90% lean ground beef 1 tbsp Worcestershire sauce 2 tbsp sugar free ketchup 2 tbsp mustard 1 tsp minced onion 1 dash of salt and pepper 4 Joseph's Lavash bread sheets 1 cup shredded cheddar cheese 2 cups lettuce 1 cup tomatoes, chopped 1 red onion, chopped", "directions": ": Cook ground beef in fry pan. Add Worcestershire sauce, ketchup, minced onion, salt, and pepper to beef and stir. Lay Lavash bread sheets flat and sprinkle cheese on each. Add beef, lettuce, and tomato to Lavash bread. Wrap filling up in Lavash bread and heat on each side for 2-3 minutes or until lightly browned.", "category": "lunch", "macros": {"calories": 600, "protein": 42, "carbs": 30, "fat": 35}}, {"id": "671a98a3fb164a4a4700a09f", "title": "Creamy Butternut Squash Pasta", "ingredients": ": 2 cups butternut squash 3 tbsp olive oil 1/4 tsp salt 1/4 tsp black pepper 1/2 lb. turkey sausage, crumbled 4 garlic cloves, minced 6 oz. spinach 1 cup heavy cream 1/3 cup shredded parmesan cheese 8 oz. Banza bow tie pasta", "directions": ": Preheat oven to 400°F. In a large bowl, toss cubed butternut squash with 1 tbsp olive oil, salt, and pepper. Spread the squash on a parchment paper-lined baking sheet in one layer and roast for 30 minutes. In a medium skillet, heat 1 tablespoon of olive oil on medium heat. Add crumbled sausage to skillet and cook for about 10 minutes, regularly stirring, until the sausage is cooked through. Set aside. Cook pasta according to package instructions. Set aside. In a separate, large skillet, heat 1 tablespoon of olive oil together with minced garlic and spinach over medium heat and cook for about 5 or 7 minutes or until spinach starts to wilt. Add heavy cream to skillet until boiling, then immediately reduce to simmer. Add shredded Parmesan cheese to skillet continuing to stir on simmer until the cheese melts. Add cooked, drained pasta, cooked sausage, and butternut squash to the skillet with the creamy spinach sauce and stir to combine.", "category": "lunch", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671f8e003cd8c723b6b2ef75", "title": "Foil Baked Salmon and Asparagus", "ingredients": ": 2 salmon fillet (around 1 lb) 2 tbsps reduced sodium bone broth 2 tsp minced garlic 1.5 tbsp lemon juice ½ tsp salt ½ tsp pepper 2 tbsp avocado oil butter 2 tbsp parsley 1 lb asparagus (450 g)", "directions": ": Preheat your oven to 425℉. Prepare 2 aluminum foil sheets (14 x 12) on top of a baking sheet. In a small mixing bowl, combine bone broth, lemon juice, garlic, butter, salt, and pepper. Lay salmon on one sheet of foil and fold edges up so that the salmon is surrounded and the mixture won’t fall out. Lay asparagus on the other sheet of foil. Spray both with cooking spray. Pour ¾ of sauce mixture on the salmon and the remaining ¼ on the asparagus. Add parsley on top of both asparagus and salmon Cook for 20-25 minutes or until salmon is cooked all the way through. Carefully unwrap each sheet of foil and let cool before eating.", "category": "dinner", "macros": {"calories": 630, "protein": 37, "carbs": 30, "fat": 35}}, {"id": "671f8f148ac1473e3a5c0241", "title": "Protein Oreo Dip", "ingredients": ": 1 cup of plain, nonfat Greek yogurt 1 cup light Cool Whip 2 tbsp sugar free instant vanilla pudding mix 4 Oreo thins", "directions": ": Add Oreos to a bag and crush them. Then, add all the ingredients to a bowl and mix! Pair with graham crackers, pretzels, etc. Enjoy!", "category": "snack", "macros": {"calories": 400, "protein": 30, "carbs": 30, "fat": 10}}, {"id": "671f931d972d0056560d5d54", "title": "Fruity Chia Seed Smoothie", "ingredients": ": 1 cup of frozen strawberries 1 medium frozen banana 1/2 cup plain non-fat Greek yogurt 1 cup unsweetened plain almond milk 1/2 tsp vanilla extract 2 tbsp chia seeds 1 cup frozen mango 100 g frozen blueberries 1 scoop vanilla protein powder", "directions": ": Add all ingredients to a blender. Blend until smooth. Enjoy!", "category": "smoothie", "macros": {"calories": 450, "protein": 50, "carbs": 30, "fat": 10}}, {"id": "671f9486a023e60e8f1d53f8", "title": "Sweet Potato Hash", "ingredients": ": 2 medium sweet potatoes, cut into cubes (3 cups) 2 tbsp olive oil ½ tsp ground cumin ½ tsp chili powder ¼ tsp sea salt 1 can of black beans, drained and rinsed 2 tsp lime juice 1 tsp pepper ¼ cup chopped cilantro", "directions": ": Preheat oven to 400℉. Prepare a baking sheet. In a large bowl, add 1 tbsp olive oil, cumin, chili powder, and salt. Mix. Add in sweet potatoes and toss until they are coated. Place sweet potatoes on the baking sheet and bake for 25 minutes or until tender. When the sweet potatoes have 5 minutes remaining, add black beans, 1 tsp lime juice, and 1 tbsp olive oil to a medium sized skillet. Mix and let saute for 5 minutes. Add sweet potatoes and other tsp of lime juice to the skillet. Stir to combine. Add cilantro on top. Let it heat for 3 more minutes and enjoy!", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 60, "fat": 10}}, {"id": "671f99746acd2952241016cf", "title": "Black Beans and Rice", "ingredients": ": 2 cups brown rice 1 tbsp olive oil ½ cup diced onion 1 medium diced bell pepper 1 ½ tsp minced garlic 3 cups reduced-sodium bone broth 1 can diced tomatoes 1 tbsp fresh chopped cilantro 2 tsp ground cumin 1 tsp chili powder ¼ tsp sea salt 2 can black beans, drained and rinsed 2 tbsp lime juice", "directions": ": Cook brown rice according to the package instructions. Heat the olive oil in a large skillet. Once oil is hot, add the onions, bell pepper, and garlic. Saute for 5 minutes. Add bone broth, cooked brown rice, beans, tomatoes, cilantro, cumin, chili powder, oregano, and salt to skillet. Stir. Bring to a boil on high heat then cover with the lid and reduce to simmer on medium low heat. Simmer for about 20-25 minutes, stirring occasionally. Stir in lime juice and let sit for 5 minutes. Serve and enjoy.", "category": "lunch", "macros": {"calories": 500, "protein": 15, "carbs": 75, "fat": 10}}, {"id": "671f9aa24cae162e91adf78a", "title": "Healthier Egg Salad", "ingredients": ": 4 large hard-boiled eggs 4 tsp Primal Kitchen Mayonaise 1/2 tsp Dijon mustard 2 tbsp chives or scallions 1/2 tsp sea salt 1/2 tsp pepper", "directions": ": Chop eggs. Combine with mayonnaise, mustard, chives, salt, and pepper.", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671f9ba44cae162e91ae4e91", "title": "Homemade Sweet Potato Fries", "ingredients": ": 32 oz sweet potato 1 tbsp olive oil 1 tsp garlic powder 1 tsp sea salt 1 tsp pepper", "directions": ": Preheat the oven to 400°F. Cut the sweet potatoes into sticks (1/4 to 1/2 inch wide and 3 inches long) and toss them with the oil. Mix the spices in a small bowl. Toss sweet potatoes in spices. Spread fries out on a baking sheet. Bake for 15 minutes, then flip and finishing cooking for 10 minutes.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 60, "fat": 10}}, {"id": "671f9c314377251cbfac8be8", "title": "Banana Oat Cookies", "ingredients": ": 2 cup oats 1/2 tsp cinnamon 1/4 tsp salt 1/2 cup creamy peanut butter (or other nut butter) 1/2 tsp vanilla extract 2 large ripe bananas 1/4 cup dark chocolate chips 1 tbsp chia seeds", "directions": ": Preheat oven to 350°F. Line a baking sheet with parchment paper. In a large bowl, combine all ingredients, stirring until well mixed. Place 2 tablespoon sized scoops onto the baking sheet. Flatten slightly, forming the shape of a cookie. Bake for 14-17 minutes, or until the edges begin to brown. Remove from the oven and cool.", "category": "breakfast", "macros": {"calories": 600, "protein": 15, "carbs": 75, "fat": 15}}, {"id": "671f9dc92238d40e5e4706c7", "title": "Iced Coffee Protein Shake", "ingredients": ": 1 cup unsweetened almond milk 2 cups ice 1 cup cold coffee or cold brew 1 scoop protein powder (chocolate or vanilla) 1 frozen banana", "directions": ": Add all ingredients to a blender. Blend until mixed well.", "category": "smoothie", "macros": {"calories": 400, "protein": 35, "carbs": 30, "fat": 10}}, {"id": "671f9e92972d0056561143c4", "title": "Healthy Cinnamon Apples", "ingredients": ": 3 apples (about 3 cups, chopped) 2 tbsp water 1 tbsp coconut oil 1 tbsp honey (sub maple syrup) ½ tsp ground cinnamon ⅛ tsp sea salt ¼ tsp pure vanilla extract", "directions": ": Cut apples into cubes. Place apples pieces into a skillet with 2 tbsp water. Cover the pan and cook over medium heat for about 5 minutes, stirring occasionally, until the apples become slightly soft and water is absorbed. Add coconut oil to the skillet. Stir apples and oil together until all the apples are coated. Cook for 5 minutes, stirring every minute or so, until the apples become soft (If apples do not soften, cover apples for the last 2 minutes). Add honey (or maple syrup), cinnamon, salt, and vanilla to apple mixture. Stir until well mixed. Cook for about 5 more minutes, stirring every minute until the apples reach your desired softness!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671f9fa0fde28b5c62607911", "title": "Peanut Butter Chia Pudding", "ingredients": ": 2 tbsp chia seeds 1 cup cashew milk 2 tbsp powdered peanut butter 1/2 scoop vanilla protein powder", "directions": ": In a container with an airtight lid or a mason jar, pour cashew milk into container. Add in chia seeds, peanut butter powder, and protein powder. Put the top on the container and shake for 15 seconds. Put the container in the refrigerator for 1 hour. Take container out and shake it again for 15 seconds. Let sit for 3 more hours in the refrigerator before enjoying", "category": "lunch", "macros": {"calories": 400, "protein": 35, "carbs": 30, "fat": 10}}, {"id": "671fa0c43cd8c723b6b94061", "title": "Healthier Baked Ziti", "ingredients": ": 8 oz ziti noodles (100% whole wheat) 1.5 lbs. ground beef 3 cups Primal Kitchen Marinara sauce 1/2 cup cottage cheese (low fat) 4 oz reduced fat mozzarella cheese 1 egg 1 tbsp olive oil 1 tbsp Italian seasoning 1 tsp minced garlic, salt, and pepper", "directions": ": Cook pasta according to package directions. While pasta is cooking, heat olive oil in a skillet. Add garlic and sauté for 1 minute. Add ground beef and seasonings to skillet and cook until done. Pre-heat oven to 375 and spray a casserole dish with cooking spray. In a large mixing bowl, add ground beef, pasta, 2 cups marinara, half of the mozzarella, cottage cheese, and egg. Add ½ cup of marinara to the bottom of the casserole dish and spread with a spoon. Then, add in the contents of the mixing bowl to dish. Top dish with another ½ cup of marinara and remaining cheese. Bake for 25 minutes.", "category": "dinner", "macros": {"calories": 600, "protein": 42, "carbs": 30, "fat": 35}}, {"id": "67213f37356f8939d0aada5b", "title": "Green Protein Smoothie", "ingredients": ": 1 banana 1 cup spinach ½ cup non-fat Greek yogurt 1 scoop protein powder ½ cup unsweetened almond milk 1 T honey or maple syrup (optional, for added sweetness) Ice cubes Toppings: coconut flakes, sliced kiwi, muesli (optional)", "directions": ": Blend together banana, spinach, Greek yogurt, protein powder, almond milk, and optional sweetener. Adjust consistency with more almond milk or ice if needed. Pour into glass or bowl. Top with coconut flakes, sliced kiwi, and muesli. Enjoy your green smoothie!", "category": "smoothie", "macros": {"calories": 450, "protein": 50, "carbs": 30, "fat": 10}}, {"id": "67314281cb2f703290f4f7c9", "title": "Sweet Potato Nachos", "ingredients": "2 large sweet potatoes 1 lb 95% lean ground beef 1 pack of taco seasoning 2 oz low fat cheese (dairy free or regular) 1 c chopped peppers ½ chopped white onion + 1 TBSP olive oil to cook (optional) Toppings 1 avocado (diced) ½ c shredded lettuce", "directions": ": 1. Slice sweet potatoes into thin rounds and place evenly on baking sheet. 2. Cook sweet potatoes for 25-30 minutes (or until browned) at 400 degrees F. 3. While sweet potatoes are in oven, (add olive oil and onion to skillet), then add ground beef into onions to cook. Season with taco seasoning of choice 4. Take sweet potato out of oven. 5. Spread ground beef, cheese, and peppers evenly over sweet potato thins. 6. Cook in oven for 5 additional minutes to melt cheese. 7. Take out of oven and add into serving dishes. 8. Top with diced avocado and lettuce. For individuals with IBS, omit onions and choose a taco seasoning without onion or garlic powder. Low amounts of red, yellow, and orange bell peppers are generally low FODMAP. Choose green bell peppers in larger amounts for a low FODMAP choice as well.", "category": "dessert", "macros": {"calories": 900, "protein": 42, "carbs": 60, "fat": 50}}, {"id": "6733657390952d64c3856f78", "title": "Berry Blast Smoothie", "ingredients": ": ½ banana ½ frozen mixed berries ½ cup spinach ½ cup non-fat Greek yogurt 1 scoop protein powder ½ cup unsweetened almond milk 1 T honey or maple syrup (optional, for added sweetness)", "directions": ": Blend together banana, berries, spinach, Greek yogurt, protein powder, almond milk, and optional sweetener. Adjust consistency with more almond milk or add ice if needed. Pour into glass and enjoy!", "category": "smoothie", "macros": {"calories": 450, "protein": 50, "carbs": 30, "fat": 10}}, {"id": "67338c006522897e3512798e", "title": "Pumpkin Patch Protein Balls", "ingredients": ": 1/3 c pumpkin puree 1/4 c peanut butter or nut butter 1 tsp vanilla 1 TBSP maple syrup (or honey) 1 serving of vanilla or unflavored protein powder 1/3 c oat flour 2 tsp pumpkin spice 1 TBSP oat milk (add additional if needed) large dark chocolate chips (for pumpkin stem)", "directions": ": 1. Mix wet ingredients in a large bowl. 2. Add dry ingredients and mix until thick dough like consistency. 3. If dough is flakey, add oat milk 1 TBSP at a time until dough it slightly sticky. 4. Roll into balls. 5. (Optional) use a string to make indented lines across ball (in order to give pumpkin look). 6. Top it off with a single chocolate chip for the stem! 7. Refrigerate and enjoy!", "category": "snack", "macros": {"calories": 400, "protein": 35, "carbs": 30, "fat": 10}}, {"id": "67339747901ed647bb3bdfef", "title": "Frozen Greek Yogurt Bark", "ingredients": ": ½ cup non-fat Plain Greek Yogurt ¼ cup strawberries, sliced 1.5 Tbsp granola", "directions": ": Spread Greek yogurt on parchment paper Add sliced strawberries Add granola Freeze until yogurt is firm Remove from freezer, and break into pieces Enjoy!", "category": "dessert", "macros": {"calories": 400, "protein": 30, "carbs": 30, "fat": 10}}, {"id": "67339977ca5692403d72d2c2", "title": "Strawberry Overnight Oats", "ingredients": ": ½ cup oats 1 scoop strawberry protein powder ¾ cup unsweetened almond milk (can sub cow’s milk or other plant-based milk) ½ cup strawberries", "directions": ": In a mason jar, add oats, scoop of protein, and unsweetened almond milk. Tighten the lid and shake until the protein powder, oats, and milk combine. Open jar and top with strawberries. Place your jar in the refrigerator for at least 2 hours or overnight. Stir before eating and enjoy!", "category": "breakfast", "macros": {"calories": 550, "protein": 35, "carbs": 55, "fat": 10}}, {"id": "6733ab54bdf92b6343913a92", "title": "Chipotle Chicken Pasta", "ingredients": ": 300g pasta shells 12oz chicken breast 1 cup arugula 14 cherry tomatoes halved Sauce ingredients: 1 cup cottage cheese 1.5oz Parmigiano Reggiano 1-2 chipotle peppers in adobe sauce 1 tablespoon of the adobe sauce 4oz fat free evaporated milk", "directions": ": Preheat oven to 400°F. Season chicken as desire (salt, pepper, onion powder, garlic powder, paprika) Bake for 20-25 minutes until cooked completely. Let cool, then cut into bite size pieces. Boil water and cook pasta according to packaging. Blend cottage cheese, chipotle peppers, evaporated milk, parmigiano reggiano, salt and pepper until creamy. In a sauce pan, add the arugula, cherry tomatoes, drained cooked pasta, chicken, and sauce. Mix until fully coated. Portion out and enjoy!", "category": "dinner", "macros": {"calories": 550, "protein": 47, "carbs": 30, "fat": 20}}, {"id": "67376bc4ee18a17ac4e6d5cc", "title": "Roasted Sausage & Veggie Medley", "ingredients": ": 1 pack (1lb) Aidell’s chicken apple sausage (or your favorite sausage), cut into 1-inch rounds 1 lb Brussels sprouts, trimmed and halved 2 sweet potatoes, cubed 1 honey crisp apple, diced", "directions": ": Preheat your oven to 425°F and line a large baking sheet. Spread the Brussels sprouts, sweet potatoes, honey crisp apple, and chicken apple sausage on the pan in a single layer. Whisk together the marinade ingredients, then pour over the veggie and sausage mix. Use your hands to mix well and coat everything evenly. Roast mixture in a single layer for 20 minutes, tossing halfway through, until everything is browned and tender. Enjoy!", "category": "breakfast", "macros": {"calories": 600, "protein": 40, "carbs": 60, "fat": 10}}, {"id": "67412ff4dd2b075c5744fc6c", "title": "High Protein Chocolate Pudding", "ingredients": ": 5 oz tofu 1/4 c unsweetened almond milk 1 TBSP Cacao 1 TBSP PB powder 1/2 serving vanilla protein of choice 1 tsp maple syrup or date syrup dark chocolate shavings (for topping)", "directions": ": Add ingredients to a food processor. Blend until smooth. Serve in a small dish and top with your favorite topping!", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}, {"id": "674131b9189710215da6ba73", "title": "Caramel Apple Bites", "ingredients": ": 9 Pitted dates 1 Green apple (diced) 1 oz D ark chocolate (melted) 2 Tbsp A lmond butter 1 tsp H imalayan sea salt", "directions": ": Dice apple into small pieces. Pit dates (if not already pitted) Fill each date with one apple piece. Drizzle with melted dark chocolate &amp; almond butter. Sprinkle with sea salt. Place in freezer for 15 minutes. Refrigerate and enjoy!", "category": "snack", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67413482585d7048611e4ae7", "title": "Homemade Peanut Butter Cups", "ingredients": ": For chocolate 1 cup dark chocolate 1 tsp coconut oil For filling 1/4 c natural PB 1/4 c oat flour 1 tsp vanilla 1 TBSP maple syrup", "directions": ": Pour dark chocolate and coconut oil in a microwave safe bowl. Microwave in 15-30 second increments, stirring between each, until chocolate is fully melted. Fill mold approximately 1/3 of volume with dark chocolate. Freeze 10-15 minutes or until chocolate layer is completely hardened. While chocolate is in freezer, mix PB, oat flour, vanilla, and maple syrup in a separate bowl until a thick dough like consistency. Take mold out of freezer, add a small portion of filling into each mold, pressing filling into the mold with your finger so that it is flat on top of the chocolate layer. Cover PB layer with melted chocolate in each mold. Freeze for 10-15 minutes or until chocolate is completely hardened. One by one, carefully pop each PB “cup” out of the mold and enjoy!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6741ce5f10e46d1419712b29", "title": "Pumpkin Spice Yogurt Parfait", "ingredients": ": 1 single serving of nonfat vanilla Greek yogurt yogurt 3 TBSP pumpkin 1 tsp pumpkin spice 1/3 cup granola 1 TBSP hemp seeds (for toppings) 1/2 TBSP almond butter (for toppings)", "directions": ": Mix the Greek yogurt, pumpkin puree, and pumpkin pie spice in bowl. Place granola at bottom of serving dish. Scoop yogurt mixture over granola. Top with toppings of choice. For higher protein options, choose nut butters, high protein granola, hemp seeds, chia seeds, or pumpkin seeds as toppers.", "category": "lunch", "macros": {"calories": 400, "protein": 30, "carbs": 30, "fat": 10}}, {"id": "67423dbb3451365d324d623d", "title": "High Protein Peanut Butter Cookie Dough", "ingredients": ": 1 container nonfat vanilla Greek yogurt (~4-5oz) (can opt for dairy free yogurt) 1/4 c PB Fit powder 1/4-1/2 c oat flour (add additional depending on consistency) 1-2 servings of protein powder or collagen (add additional depending on consistency) 2 TBSP dairy free chocolate chips", "directions": ": Mix ingredients together until desired consistency, adding extra flour or protein powder as needed. Store in fridge and enjoy throughout the week.", "category": "dessert", "macros": {"calories": 650, "protein": 50, "carbs": 50, "fat": 15}}, {"id": "6742575c864ce56c1c7ff472", "title": "3 ingredient baked tacos", "ingredients": ": 12 Corn tortillas 1lb G round turkey or beef 6 oz Shredded cheese (Opt for d airy free if desire) Optional: Green onion topping", "directions": ": Cook ground meat on skillet (season with taco seasoning as desired). Place corn tortillas on non stick sheet pan. Fill with meat and cheese. Fold tortillas into tacos. Place weighted object on tortillas to hold in place (e.g. metal spoon) Bake for 20 minutes at 400 degrees. Optional, top with green onion.", "category": "lunch", "macros": {"calories": 600, "protein": 42, "carbs": 30, "fat": 35}}, {"id": "67433f07bd2a08017d3a8cc3", "title": "Egg Roll in a Bowl", "ingredients": ": 1lb ground turkey 1 packet raw cole slaw 2 TBSP coconut amino (sub soy sauce &amp; maple syrup) 1 TBSP olive oil", "directions": ": Oil pan. Cook ground turkey in pan on medium heat. Add 1 pack of cole slaw to pan and cover. Cook on medium heat until slaw is lightly browned. Add coconut amino sauce as desired.", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "674d2756538d2a6a09754de5", "title": "Bone Broth Hot Chocolate", "ingredients": ": 1 cup bone broth 2 TBSP unsweetened cocoa 1 TBSP maple syrup (sub two packets stevia) 1/2 cup soy milk (sub fat free milk) 1/2 tsp cinnamon 2 oz marshmallows (optional) peppermint stick (optional)", "directions": ": Heat bone broth, cocoa, maple syrup, soy milk, and cinnamon in a pot on low, stirring to mix ingredients and keep from burning. Top with marshmallows and toss in a peppermint stick for a festive flavor!", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}, {"id": "674e032bd616f449d03820f8", "title": "Peppermint Chocolate Mousse Parfait", "ingredients": ": 1 container vanilla yogurt (sub high protein dairy free yogurt) 1 scoop chocolate protein powder (sub cocoa powder) 1/8 tsp peppermint extract Toppings Gluten Free peppermint Joe Joes (Trader Joes) Smashed peppermint", "directions": ": Mix peppermint extract, yogurt, and chocolate protein powder in one bowl. Top with smashed peppermint cookies and peppermint", "category": "dessert", "macros": {"calories": 550, "protein": 35, "carbs": 50, "fat": 15}}, {"id": "674f20193ea64a54556c637b", "title": "Snow Globe Mocktail", "ingredients": ": 1 rosemary leaf Approx. 1/2 c or 1 handful of whole cranberries water Probiotic soda or beverage of choice", "directions": ": Prepare the Glass : Take one glasses and place a small handful of cranberries at the bottom. Prepare the Rosemary : Take a sprig of rosemary, turn it upside down, and trim the bottom so it’s even. Spread out the bottom leaves slightly to help it stand upright in the glass. Assemble the Glass : Place the rosemary sprig into the middle of the glass. Pour water into the glass, covering the cranberries and stabilizing the rosemary. Alternatively, pour water first, then position the rosemary sprig so it stays upright. Freeze : Set the glass on a small baking sheet for stability and place in the freezer. Freeze for about 45 minutes, or until the water is completely frozen. Serve : Remove the glass from the freezer and serve immediately. Pour your favorite sparkling water or probiotic drink over the frozen setup for a magical \"snow globe\" effect. Cronometer recipe uses a Cran fizz Poppi.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6750718a557b15543b77f295", "title": "Sugar Cookie Overnight Oats", "ingredients": ": ½ cup oats 1 cup soy milk (unsweetened) 1 scoop vanilla protein (Kion clean protein) 1 serving collagen (optional, included in Cronometer recipe) 1/8 tsp vanilla extract 1/8 almond extract 1 dash of salt 1 tsp maple syrup As many sprinkles as the hear desires (1 tsp added in Cronometer recipe)", "directions": ": Mix all ingredients in an air tight container. Store in fridge overnight. Remove from fridge, add sprinkles, and enjoy.", "category": "breakfast", "macros": {"calories": 600, "protein": 15, "carbs": 75, "fat": 15}}, {"id": "67520e9a664de650edca0624", "title": "Salted Peppermint Mocha", "ingredients": ": Mint Double espresso (sub for regular espresso with 1/8 tsp peppermint extract) Drink LMNT chocolate salt (sub for 1/4 tsp salt &amp; chocolate protein powder) 1/2 c choice of milk (Cronomter recipe uses fairlife ultrafiltered skim milk)", "directions": ": Mix (peppermint) double espresso with chocolate salt. Pour milk over ice. Pour espresso over milk &amp; ice. Stir and enjoy.", "category": "lunch", "macros": {"calories": 400, "protein": 35, "carbs": 30, "fat": 10}}, {"id": "675741f1d52e241947ff8664", "title": "Candy Cane Crunch Cake", "ingredients": ": 1 Rice cake 1 Tbsp Nut butter of choice 2 tsp hemp seeds 11g dark chocolate 1 crushed peppermint", "directions": ": Cover rice cake with nut butter. Sprinkle hemp seeds over nut butter. Dip in melted dark chocolate. Sprinkle crushed peppermint on top of melted chocolate. Freeze for 10 minutes.", "category": "dessert", "macros": {"calories": 650, "protein": 15, "carbs": 95, "fat": 15}}, {"id": "675745fead49685c1ad25d28", "title": "Egg Nog Latte", "ingredients": ": Double espresso of choice 1/2 c egg nog of choice (Almond Malk Holiday Nog used in Cronometer recipe) As much nutmeg as the heart desires", "directions": ": Brew double espresso in mug. While brewing espresso, froth 1/2 c egg nog. Pour frothed nog over espresso. Top with nutmeg. Enjoy hot or over ice. For high protein, choose cow’s milk or soy based egg nog or add in 1 serving of collagen.", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "675747751b44df1fb7b3d111", "title": "Oat Nog Ninja Creami", "ingredients": ": 1 1/2 c Chobani oat nog + 3 TBSP for mix in 1 serving collagen 1 scoop vanilla protein 1/2 tsp nutmeg", "directions": ": Add oat nog, collagen, vanilla protein, and nutmeg to Ninja Creami pitcher. Froth or blend contents to mix. Place lid on container and freeze for at least 24 hours. Place container in Ninja Creami and run on “lite ice cream” selection. Add 3 TBSP oat nog and press ‘’re-spin” Remove from machine &amp; enjoy!", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "675777f5a0b4f82fb333d981", "title": "Spiced Orange Cran Mocktail", "ingredients": ": Ice cubes 1 orange 1 pack of cranberries Mocktail base 2 oz orange sparkling beverage (Orange Poppi Prebiotic soda was used in the Cronometer recipe) 6 oz cranberry juice 1 cinnamon stick", "directions": ": Ice Cubes: Slice orange into rounds. Place one orange slice into each ice cube mold. Add a handful of cranberries into each mold. Pour water (Or beverage of choice) to fill mold. Freeze for at least 24 hours. Mocktail Place ice cube in glass. Pour orange sparkling beverage over ice. Add cranberry juice. Stir with cinnamon stick.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "675999b2dd986b13f3766eba", "title": "Winter Spiced Overnight Oats", "ingredients": ": ½ cup oats ¾ cup unsweetened almond milk 1 scoop vanilla protein (Kion clean protein) 1 TBSP collagen (optional, included in Cronometer recipe) 1 tsp maple syrup ¼ tsp nutmeg ½ tsp cinnamon 1 TBSP dried cranberries 1 TBSP chopped pecans", "directions": ": Mix oats, protein powder, collagen, cinnamon, nutmeg maple syrup, and almond milk together. Store in fridge overnight or for a few hours. Remove from fridge, top with dried cranberries, chopped pecans, and enjoy!", "category": "breakfast", "macros": {"calories": 450, "protein": 15, "carbs": 55, "fat": 10}}, {"id": "675a1b749045e814087c2962", "title": "Winter Chicken Bowl", "ingredients": ": 2 c kale 1 cooked chicken breast (4 oz) 3 oz cooked sweet potato (diced) 3 oz cooked broccoli 1/4 c pomegranate seeds 1-2 TBSP crushed almonds 2 TBSP balsamic glaze", "directions": ": Precook chicken, broccoli, and sweet potatoes in the oven. Fill bowl with pre-washed chopped kale. Add chicken breasts, roasted sweet potatoes, and broccoli. Sprinkle with pomegranate seeds and almonds. Finish it off with a few drizzles of balsamic glaze.", "category": "lunch", "macros": {"calories": 600, "protein": 40, "carbs": 60, "fat": 10}}, {"id": "675a1e9d8c4fee71a92a88bb", "title": "Gingerbread Shaken Espresso", "ingredients": ": 1/8 tsp ground ginger 1/8 tsp all spice 1 tsp coconut sugar Double espresso Dairy free Ginger bread creamer (as much as the heart desires)", "directions": ": Brew double shot over ginger, all spice, and coconut sugar. Shake mixture in mason jar. Pour over ice. Add Gingerbread creamer!", "category": "smoothie", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "675f84fdef7a185351acc810", "title": "High Protein “Snickers Salad”", "ingredients": ": 1 single serve container of vanilla greek yogurt (dairy free optional) 1 caramel chocolate protein bar of choice (gluten &amp; dairy free optional) 1 green apple 2 TBSP date syrup", "directions": ": Chop protein bar and apple into bite sized pieces. Line cup or bowl with date syrup. Layer apple, protein bar pieces, and yogurt into cup or bowl, adding in date syrup between layers as desired. Top with date syrup, stir, &amp; enjoy.", "category": "lunch", "macros": {"calories": 400, "protein": 30, "carbs": 30, "fat": 10}}, {"id": "675f8a69ef4418097634740f", "title": "Gingerbread Protein Pancakes", "ingredients": ": 1 (115g) banana 110g egg white 1 scoop vanilla protein powder 2 TBSP oat flour 1 tsp all spice 1 tsp nutmeg 1/2 tsp ginger 1/8 tsp baking powder", "directions": ": Blend ingredients in blender. Heat non-stick pan on low. Spoon batter onto pan, making pancakes of desired size. Flip pancakes when batter starts to bubble. Finish cooking to desired texture.", "category": "breakfast", "macros": {"calories": 550, "protein": 35, "carbs": 50, "fat": 15}}, {"id": "67684ce922d2f137d6bd8f4e", "title": "Sweet Potato Toast", "ingredients": ": 1 large sweet potato Avocado Spray cooking oil Toppings of choice", "directions": ": Cut sweet potato into thin slices. Spray slices with oil. Cook at 400 degrees F for 15-20 minutes or until lightly browned. Add toppings of choice.", "category": "breakfast", "macros": {"calories": 600, "protein": 15, "carbs": 60, "fat": 25}}, {"id": "676df20441e1da20f3caeea7", "title": "Peppermint Mocha Smoothie", "ingredients": ": 1 banana frozen 1/3 c frozen cauliflower 1 cup soy milk 1 scoop collagen, unflavored 1/8 tsp peppermint 2 TBSP Cocoa powder, unsweetened (sub chocolate protein) 1 tsp maple syrup 4-5 small ice cubes (or 2 large)", "directions": ": Blend ingredients in blender. Top with peppermint. Pour into festive cup &amp; enjoy. This recipe is gluten and dairy free. To make IBS friendly use a firm banana and remove frozen cauliflower!", "category": "smoothie", "macros": {"calories": 250, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "670fe0ce3ee9f70713754887", "title": "Almond Joy Overnight Oats", "ingredients": ": 1/3 cup oats 1/4 cup unsweetened almond milk 1/3 cup coconut Greek yogurt 1 scoop chocolate protein powder 1/2 tbsp shredded coconut 1 tbsp dark chocolate chips 1/2 tsp cocoa powder 1/2 tbsp sliced almonds", "directions": ": In a mason jar, add the almond milk and protein powder. Tighten the lid and shake it so the protein powder combines with the milk. Add other ingredients. Close the lid and shake to combine. Place your jar in the refrigerator for at least 2 hours or overnight. Stir before eating and enjoy!", "category": "breakfast", "macros": {"calories": 650, "protein": 50, "carbs": 55, "fat": 10}}, {"id": "670fe49951592f74d1b4a050", "title": "Healthier Breakfast Burrito", "ingredients": ": 1 whole wheat tortilla 2 scrambled eggs 1/4 cup turkey sausage 1/4 cup shredded cheddar cheese 1/2 cup spinach", "directions": ": Cook the eggs and sausage first in separate pans. Add the spinach in the pan with the eggs. Once those are cooked, heat the tortilla in the microwave for 5 seconds. Then build the burrito using eggs with spinach first, then sausage, and adding cheese on top. Fold tightly and enjoy!", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a6c3dfa68bb6871901443", "title": "Healthier Breakfast Sandwich", "ingredients": ": 1 Multigrain English Muffin 3 tbsp egg whites, cooked 1 light Laughing Cow cheese wedge 1 Turkey Sausage patty", "directions": ": For the egg whites, use a muffin pan and pour 3 tbsp in each tin. Bake for 10 minutes at 350°F. While those are cooking, heat the English muffin and cheese in a toaster oven and microwave the turkey sausage patty according to the package directions. Then stack the egg white muffin and sausage patty on the English muffin.", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a6d57a1b4411b8077af64", "title": "Spinach & Cheese Egg Muffins", "ingredients": ": 1 cup egg whites 1/2 cup spinach, chopped 1/2 cup shredded mozzarella cheese Dash of sea salt and pepper", "directions": ": Preheat the oven to 350℉. Spray a 6 muffin tin with cooking spray. Mix egg whites, cheese, spinach, and salt and pepper. Pour mixture evenly among tins. Cook for 18 minutes or until the eggs are cooked all the way through. Let cool before eating. Enjoy!", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a6dfa09a73b6316bfaa59", "title": "Chicken Avocado Melt", "ingredients": ": 2 slices Dave's multigrain bread 1/2 avocado 3 oz grilled chicken breast 1 slice mozzarella cheese 1 dash sea salt 1 dash pepper", "directions": ": Toast bread according to preference. Dice avocado into small pieces and sprinkle salt and pepper on the pieces. Once bread is finished toasting, spread avocado onto toast and mash into a jam like consistency. Cook chicken breast according to preference and top with cheese to melt. Place on slice of toast and top with other piece of toast and enjoy!", "category": "dinner", "macros": {"calories": 700, "protein": 47, "carbs": 30, "fat": 35}}, {"id": "671a6fe7fbef337c00acc8b6", "title": "Greek Turkey Burgers", "ingredients": ": Turkey Burgers: 24 oz ground turkey 1/2 cup reduced-fat feta cheese 4 tsp minced garlic 1 small red onion, diced 1 cup spinach 1/2 tsp oregano 1 tsp sea salt 1/2 tsp pepper Homemade Tzatziki: 1/4 cup fat-free Greek yogurt 1/2 tsp lemon juice 1 large sprig of dill 3-4 sliced pickles, diced", "directions": ": Combine all ingredients for the turkey burgers in a large bowl. Form into patties. On stove top, heat a large skillet and cook for 5 minutes, flip, then turn the heat to medium low. Cover for the next 5 minutes until all burgers are cooked. Preheat oven to 375 and cook for ~25 minutes. Serve with bun, fries, Greek salad, etc.", "category": "lunch", "macros": {"calories": 500, "protein": 37, "carbs": 30, "fat": 20}}, {"id": "671a76f5b84df063894df6c6", "title": "Taco Chicken", "ingredients": ": 2 lb raw chicken breast 2 packets fajita or taco seasoning 1 packet of ranch seasoning", "directions": ": Preheat oven to 375°F. Slice chicken into half inch strips. Put the strips in a bowl and toss them in the fajita and ranch seasonings. Bake for about 20 mins, or until they are cooked completely.", "category": "dinner", "macros": {"calories": 450, "protein": 40, "carbs": 30, "fat": 10}}, {"id": "671a76f5f1f98b4ffb86af42", "title": "Salmon Burger", "ingredients": ": 1 salmon fillet 2 tbsp dijon mustard 1 tbsp cilantro 1 tbsp parsley 1/2 tsp salt 1/2 tsp pepper 1/2 tsp paprika 1/4 cup breadcrumbs 1/2 tbsp olive oil", "directions": ": Cut the salmon fillet into 1-inch pieces. In a food processor or blender, add salmon cubes, mustard, herbs, salt, pepper, and paprika. Pulse until mixed together well. There should be some small chunks. Transfer salmon mixture to a medium-sized bowl. Add the breadcrumbs and mix with a spatula until combined. Evenly divide the salmon mixture into four portions (about 4-oz. each) then shape into patties. Cook on the stovetop over medium high heat until the fillet is golden brown. Flip and let it cook for a few more minutes.", "category": "lunch", "macros": {"calories": 480, "protein": 37, "carbs": 30, "fat": 20}}, {"id": "671a7824627a3a6727d2adc4", "title": "Crockpot BBQ Chicken", "ingredients": ": 2 lb boneless skinless chicken breast 1.5 cups Primal Kitchen BBQ sauce 1/4 cup apple cider vinegar 1/2 tsp onion powder 1/2 tsp garlic powder", "directions": ": In a bowl, mix BBQ sauce, vinegar, onion and garlic powder. Place chicken breasts in the bottom of the crockpot. Pour the sauce over the chicken and cook chicken on high for 2-3 hours or until completely cooked. Shred the chicken once finished cooking.", "category": "dinner", "macros": {"calories": 450, "protein": 40, "carbs": 30, "fat": 10}}, {"id": "671a78c80270cf4c7d371e94", "title": "Mediterranean Wrap", "ingredients": ": 1 Joseph's Lavash Wrap 4 oz grilled chicken 10 g onion 30 g hummus 60 g tomatoes 30 g reduced-fat feta cheese 40 g cucumber 20 g pickles 40 g spinach 60 g homemade tzatziki sauce Homemade Tzatziki: 60 g fat-free Greek yogurt 1 g lemon juice 1 large sprig of dill 25 g diced pickles", "directions": ": Make Tzatziki sauce by mixing Greek yogurt, lemon juice, dill, and diced pickles into a small bowl. Set aside. Dice the tomatoes, cucumber, and pickles. Spread hummus on the lavash wrap. Layer onion, tomatoes, feta cheese, and thin slices of cucumber in the middle of the wrap. Slice the grilled chicken into strips. Add the pickles, spinach, and homemade tzatziki sauce. Wrap it up and enjoy!", "category": "lunch", "macros": {"calories": 650, "protein": 62, "carbs": 30, "fat": 20}}, {"id": "671a79af210b270fc64758f6", "title": "Ground Turkey Sweet Potato Bake", "ingredients": ": 1 lb ground turkey 2 medium sweet potatoes, peeled and diced 2 zucchini, diced 2/3 cup shredded parmesan cheese 1 tsp garlic powder 1 tsp rosemary 5 tbsp olive oil 1/4 tsp salt and pepper", "directions": ": Preheat oven to 400°F. Place in a large baking dish and toss the diced sweet potatoes with 2 tbsp olive oil, 1/2 tsp garlic powder, 1/2 tsp rosemary, salt, and pepper. Bake the sweet potatoes for 30 minutes. While sweet potatoes are in the oven, sauté the ground turkey in a pan with 1 tbsp olive oil, 1 tsp garlic powder, 1/2 tsp rosemary, salt, and pepper. Remove the sweet potato from the oven. Layer the ground turkey and diced zucchini on top of the sweet potatoes. Bake for 10 minutes. Add in an additional 2 tbsp olive oil, mix, and top with the shredded parmesan cheese. Bake for 10 minutes.", "category": "dessert", "macros": {"calories": 550, "protein": 22, "carbs": 60, "fat": 20}}, {"id": "671a7db73975d320de6a3bbf", "title": "Crockpot Sante Fe Chicken", "ingredients": ": 20 oz chicken 1 can (14 oz) diced tomatoes 1 can (15 oz) black beans 8 oz frozen corn 1/4 cup cilantro 14 oz chicken broth 1 tsp garlic powder, onion powder, ground cumin, and sea salt 1/2 avocado, sliced (for topping)", "directions": ": Combine all ingredients in a crockpot and cook on low for 8 - 10 hours or on high for 4 to 6 hours. Add avocado slices on top before serving.", "category": "dinner", "macros": {"calories": 600, "protein": 40, "carbs": 30, "fat": 25}}, {"id": "671a7e458e78834f3dbd762b", "title": "Blueberry Coconut Chia Seed Pudding", "ingredients": ": 1 cup unsweetened coconut milk 1/4 cup water 1 tsp vanilla extract 6 tbsp chia seeds 1.5 cup frozen blueberries 2 tbsp water", "directions": ": You will need a container with an airtight lid. A Mason jar works best. Pour coconut milk first. Then, add in the chia seeds, 1/4 cup water, and vanilla extract. Put the top on and shake it for 15 seconds. Add frozen blueberries and 2 tbsp water to a sauce pan and heat on medium. After about 3-5 minutes, smash the blueberries. Reduce the heat to medium-low to simmer for 10 minutes, stirring frequently. Once cooled, add the sauce on top of the chia pudding. Put the container in the refrigerator for 4 hours. Take it out and stir it up and enjoy!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671a7ed526ce9354e2ba50e0", "title": "Lightened Up Green Bean Casserole", "ingredients": ": 1 lb fresh green beans, trimmed and cut into bite-sized pieces 2bsp olive oil 1 small onion, finely chopped 2 cloves garlic, minced 8 ounces mushrooms, sliced 2 tbsp whole wheat flour 1 cup low-sodium vegetable broth 1 cup unsweetened almond milk (or any other milk alternative) Salt and pepper to taste 1 tsp dried thyme 1 cup whole grain breadcrumbs 2 tbsp grated Parmesan cheese (optional) Cooking spray", "directions": ": Preheat the oven: Preheat your oven to 375°F (190°C). Blanch the green beans: Bring a large pot of water to a boil. Add the green beans and cook for 3-4 minutes, then immediately transfer them to a bowl of ice water to stop the cooking process. Drain and set aside. Make the mushroom sauce: In a large skillet, heat the olive oil over medium heat. Add chopped onions and garlic, sautéing until softened. Add sliced mushrooms and cook until they release their moisture and become golden brown. Sprinkle flour over the mushroom mixture and stir well to coat. Cook for 1-2 minutes to remove the raw flour taste. Slowly whisk in the vegetable broth and almond milk. Stir continuously until the mixture thickens. Season with salt, pepper, and dried thyme. Allow the sauce to simmer for a few minutes until it reaches a creamy consistency. Assemble the casserole: Add the blanched green beans to the mushroom sauce, stirring until well coated. Transfer the mixture to a lightly greased baking dish. Prepare the topping: In a small bowl, mix the whole grain breadcrumbs with grated Parmesan cheese (if using). Sprinkle the breadcrumb mixture evenly over the green bean mixture. Bake: Bake in oven for 20-25 minutes or until the top is golden brown and the casserole is bubbling around the edges. Serve: Allow the casserole to cool for a few minutes before serving. Enjoy your healthier green bean casserole! #side #recipes #seasonal #Thanksgiving #casserole #holiday #sidedish #vegetables", "category": "dinner", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a7f3d48582c7dd3420462", "title": "Roasted Brussels Sprouts with Balsamic Glaze", "ingredients": ": 1 lb Brussels sprouts, trimmed and halved 2 tbsp olive oil Salt and black pepper to taste 2 tbsp balsamic vinegar 1 tbsp honey or maple syrup (optional, for sweetness) 1-2 cloves garlic, minced (optional, for added flavor) 2 tbsp chopped fresh parsley (for garnish, optional)", "directions": ": Preheat the Oven: Preheat your oven to 400°F (200°C). Prepare Brussels Sprouts: Trim the ends of the Brussels sprouts and cut them in half. Place them in a large bowl. Seasoning: Drizzle olive oil over the Brussels sprouts, ensuring they are evenly coated. Season with salt and black pepper to taste. Add minced garlic if desired. Roast Brussels Sprouts: Spread the Brussels sprouts in a single layer on a baking sheet. Roast in oven for 20-25 minutes or until they are golden brown and crispy on the edges. Shake or stir them halfway through to ensure even cooking. Prepare Balsamic Glaze: While the Brussels sprouts are roasting, prepare the balsamic glaze. In a small saucepan, heat balsamic vinegar over medium heat. Optional: add honey or maple syrup for sweetness. Simmer for 5-7 minutes or until the vinegar has reduced by half and has a syrupy consistency. Combine and Glaze: Once the Brussels sprouts are done roasting, transfer them to a serving bowl. Drizzle the balsamic glaze over the roasted Brussels sprouts and toss them to coat evenly. Garnish and Serve: Optionally, garnish with chopped fresh parsley for a burst of freshness. Serve Warm: Serve the roasted Brussels sprouts with balsamic glaze immediately while warm. #side #recipes #seasonal #Thanksgiving #vegetables #sidedish #holiday", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671a8252f3c7c9218394a859", "title": "Thanksgiving Kale Salad with Roasted Butternut Squash", "ingredients": ":", "directions": ": Roast Butternut Squash: Preheat your oven to 400°F (200°C). Toss the diced butternut squash with a bit of olive oil, salt, and pepper. Spread the squash on a baking sheet in a single layer and roast for 20-25 minutes or until tender and golden brown. Allow it to cool. Prepare Kale: In a large bowl, massage the kale with a bit of olive oil for a few minutes until it becomes tender and dark green. Assemble the Salad: Add the roasted butternut squash, toasted pumpkin seeds, dried cranberries, and crumbled feta cheese (optional) to the massaged kale. Prepare the Dressing: In a small bowl, whisk together the olive oil, balsamic vinegar, maple syrup or honey, Dijon mustard, salt, and pepper. Dress the Salad: Pour the dressing over the salad and toss everything together until well coated. Chill (Optional): If time allows, let the salad chill in the refrigerator for 30 minutes to allow the flavors to meld. Serve: Serve the kale salad in a large bowl or on a platter, and sprinkle additional pumpkin seeds and cranberries on top for garnish if desired. #side #recipes #seasonal #Thanksgiving #salad #holiday #holidaymeal", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671a82c7b84df06389521851", "title": "Sweet Potato Casserole with Pecan Topping", "ingredients": ":", "directions": ": Preheat the Oven: Preheat your oven to 375°F (190°C). Cook Sweet Potatoes: Place the sweet potato cubes in a large pot of water and bring to a boil. Cook until the sweet potatoes are tender, about 15-20 minutes. Drain the sweet potatoes and transfer them to a large mixing bowl. Mash Sweet Potatoes: Mash the sweet potatoes with a potato masher or fork until smooth. Add Ingredients to the Filling: Add beaten egg, coconut oil, maple syrup (or honey), cinnamon, nutmeg, almond milk, vanilla extract, and a pinch of salt to the mashed sweet potatoes. Mix well until combined. Prepare the Pecan Topping: In a separate bowl, combine chopped pecans, whole wheat flour, melted coconut oil, maple syrup (or honey), cinnamon, and a pinch of salt. Mix until the pecans are evenly coated. Assemble the Casserole: Transfer the sweet potato mixture to a baking dish, spreading it evenly. Add Pecan Topping: Sprinkle the pecan topping evenly over the sweet potato layer. Bake: Bake in oven for 25-30 minutes, or until the pecan topping is golden brown. Serve: Allow the casserole to cool for a few minutes before serving. #side #recipes #seasonal #Thanksgiving #casserole #holiday #holidaymeal", "category": "dessert", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671a836d6c3dbc11dcf3f49c", "title": "Apple Crisp Crumble", "ingredients": ": Apple Portion: 6 apples 1 tbsp cinnamon dash of salt 2 tsp coconut oil Crumble Portion: 2/3 cup oats 2/3 cup pecans 1 tbsp coconut oil 2 tsp honey", "directions": ": Preheat oven to 350°F. Chop the apples and saut é them along with cinnamon, salt, and coconut oil in a pan at medium high heat for 2-3 minutes. In a food processor, mix all crumble ingredients with 1 tbsp of water until throughly combined. Add crumble and apple mixture to a small baking pan and bake for 15-20 minutes.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 55, "fat": 10}}, {"id": "671a8bd7fb164a4a47fc12a4", "title": "Blueberry Breakfast Bake", "ingredients": ": Base: 2 cups old fashioned oats 1/2 cup almond butter 2 large bananas 1/2 cup blueberries 1/4 cup hazelnuts Topping (optional): 1/2 cup Swerve sweetener 2 tbsp coconut milk", "directions": ": Preheat the oven to 350 °F. In a large mixing bowl, combine all base ingredients, and mix well. Bake for 20-25 minutes, or until completely cooked. Remove from the oven and allow it to cool in the pan for 15 minutes, before carefully transferring to a wire rack to cool completely. Once cool, drizzle the topping.", "category": "breakfast", "macros": {"calories": 450, "protein": 15, "carbs": 55, "fat": 10}}, {"id": "6728275e5d817503e89fba37", "title": "Pumpkin Smoothie", "ingredients": ": 1/3 frozen banana 1 cup unsweetened oat milk 1/3 cup frozen riced cauliflower ¼ cup pumpkin pure 1 serving vanilla protein powder 2 dates (soaked in hot water for 15 minutes) 1 tsp pumpkin spice 1 TBSP date syrup (for glass)", "directions": ": Blend ingredients until smooth. Spread date syrup on inside of glass. Pour into glass and enjoy.", "category": "smoothie", "macros": {"calories": 550, "protein": 35, "carbs": 75, "fat": 10}}, {"id": "673367b85e834a657680db44", "title": "Peanut Butter Banana Smoothie", "ingredients": ": 1 banana 2 Tbsp natural peanut butter ½ cup non-fat Greek yogurt 1 scoop protein powder (Kion protein) ½ cup unsweetened almond milk 1t Cinnamon (optional) 1 tsp honey or maple syrup (optional, for added sweetness) (not included in Cronometer calculation) For additional calories: add ¼ cup to ½ cup oats (not included in Cronometer calculation)", "directions": ": Blend together banana, peanut butter, Greek yogurt, protein powder, almond milk, and optional ingredients. Adjust consistency with more almond milk or add ice if needed. Pour into glass and enjoy!", "category": "smoothie", "macros": {"calories": 600, "protein": 50, "carbs": 55, "fat": 10}}, {"id": "673374216c1a1808a50a6007", "title": "Tropical Paradise Smoothie", "ingredients": ": ½ cup frozen mango ½ cup frozen pineapple ½ banana ½ cup non-fat Greek yogurt 1 scoop protein powder (Kion protein) ½ cup unsweetened coconut milk 1 tsp honey or maple syrup (optional, for added sweetness) (not included in Cronometer calculation)", "directions": ": Blend together mango, pineapple, banana, Greek yogurt, protein powder, coconut milk, and optional sweetener. Adjust consistency with more almond milk or add ice if needed. Pour into glass and enjoy!", "category": "smoothie", "macros": {"calories": 450, "protein": 50, "carbs": 30, "fat": 10}}, {"id": "6733751d0e06e441e5090d6b", "title": "Chocolate Banana Protein Smoothie", "ingredients": ": 1 banana 1 Tbsp unsweetened cocoa powder ½ cup non-fat Greek yogurt 1 scoop protein powder (Kion protein) ½ cup unsweetened almond milk 1 tsp honey or maple syrup (optional, for added sweetness) (not included in Cronometer calculation)", "directions": ": Blend together banana, cocoa powder, Greek yogurt, protein powder, almond milk, and optional sweetener. Adjust consistency with more almond milk or add ice if needed. Pour into glass and enjoy!", "category": "smoothie", "macros": {"calories": 600, "protein": 50, "carbs": 50, "fat": 15}}, {"id": "67337a6dcca7572d7d86fa94", "title": "Greek Crockpot Chicken", "ingredients": ": 1 cup Greek yogurt Z est and juice of 1 lemon 1 tsp salt 1 Tbsp minced garlic Optional: 1 Tbsp dill 2 lb boneless skinless chicken breast", "directions": ": Place chicken breasts in the bottom of the crockpot. Mix the Greek yogurt, lemon zest and juice, salt, garlic, and dill in a bowl. Pour half of the marinade over the chicken. Cook on high for 4 hours or low for 6-8 hours. Once done, remove chicken and shred with forks. Drain off all but about 1/2 cup of remaining juices and add your chicken back to the pot. Mix in the remaining marinade and you’ve got yourself a delicious protein packed dish for dinner. Serve with rice, pita bread, sliced cucumber, chopped tomato, sliced red onions, and/or fresh parsley.", "category": "dinner", "macros": {"calories": 550, "protein": 55, "carbs": 30, "fat": 10}}, {"id": "6733804eb7d41c5a31b071b2", "title": "High-Protein Spinach Artichoke Dip", "ingredients": ": 16oz cottage cheese 5.3oz plain fat-free Greek yogurt 5oz frozen spinach (thawed &amp; drained well) 6oz can artichokes (drained &amp; chopped) ½-¾ cup mozzarella cheese ¼ cup parmesan cheese 1 tsp onion powder 1 tsp garlic powder ½ tsp pepper", "directions": ": Preheat oven to 400°F. Thaw and drain spinach &amp; artichokes thoroughly (squeeze out excess liquid). Mix all ingredients together in a bowl. Pour into an 8x8 glass dish (or medium oval pan) and top with extra cheese if desired. Bake for 25 minutes, then broil for 1-2 minutes to get that perfect golden top. Serve with chips or veggies of your choice! Whether it’s for game day or your next gathering, this dip is a crowd-pleaser that’s as healthy as it is delicious!", "category": "snack", "macros": {"calories": 500, "protein": 37, "carbs": 30, "fat": 20}}, {"id": "6733949d36d24c18d25b6f39", "title": "Healthy Chicken Salad", "ingredients": ": 1.5 lbs boneless skinless chicken breast ½ cup non-fat plain Greek yogurt ½ cup light mayo 1 cup celery, chopped 1 cup grapes, halved ¼ cup slivered almonds", "directions": ": Cook chicken breast. If using Instant pot : Place chicken breast in pot, add 1 cup of water, and any desired seasoning (salt, pepper, garlic powder, onion powder). Set Instant pot to pressure cook high for 10 minutes, release steam after 2-5 minutes. Shred chicken. Place cooked chicken breasts in a mixer and using the paddle attachment mix until shredded to desired consistency. Or shred manually with two forks. Mix the Greek yogurt and mayo Add in mix-ins: celery, grapes, almonds and mix. Chill and Enjoy!", "category": "lunch", "macros": {"calories": 550, "protein": 55, "carbs": 30, "fat": 10}}, {"id": "674129555d5bec25d614fbbf", "title": "Buffalo Chicken Meatballs", "ingredients": ": 1 lb ground chicken 2 TBSP chopped parsley 2 TBSP chopped green onion (green portion only) 1 tsp salt 1/2 tsp pepper 1/4 c finely diced celery 1 slice finely crumbled bread or 1/3 c bread crumbs (can opt for gluten free) 1/4 c buffalo sauce chopped green onion (for garnish)", "directions": ": Add ingredients to food processor. Process on low speed until ingredients are well mixed. Roll mixture into twelve balls and place on parchment lined pan. Bake at 400 degrees F for 15-20 minutes. Flip meatballs halfway through cooking time. Top with additional buffalo sauce and green onion.", "category": "dinner", "macros": {"calories": 450, "protein": 40, "carbs": 30, "fat": 10}}, {"id": "67412e020c59f53ba44ad890", "title": "Breakfast Quesadilla", "ingredients": ": 1 tortilla (can opt for gluten free if needed) 2 eggs and 1/4 c egg white Cheese (can opt for dairy free if needed) 2 breakfast maple chicken sausage links green onions (garnish)", "directions": ": Whisk two eggs and 1/4 c egg white in bowl. Pour whisked eggs into nonstick fry pan on low to medium heat. Cook eggs frittata style. While eggs are cooking heat tortilla on separate pan. Sprinkle cheese across tortilla. Add frittata on top of cheesy tortilla. Add an additional layer of cheese on top of frittata. Place halved sausages on top of egg on one half of tortilla. Fold tortilla in half to make into quesadilla. Heat both halves of the quesadilla until light brown. Cut in half and serve.", "category": "breakfast", "macros": {"calories": 550, "protein": 47, "carbs": 30, "fat": 20}}, {"id": "6741c94ef50079330b1181a8", "title": "Chocolate Chip Pumpkin Bread", "ingredients": ": Wet Ingredients: 1 cup organic pumpkin purée 1/3 cup maple syrup 1/4 cup coconut oil 1 tsp vanilla extract 3 eggs 1/3 cup creamy almond butter (or cashew butter for sweeter taste) Dry Ingredients: 1 tbsp pumpkin spice 1/4 cup almond flour 3 tbsp oat flour 1 tsp baking soda 1/2 tsp salt 1 scoop unflavored collagen 1/4 cup chocolate chips", "directions": ": Mix wet ingredients. Mix dry ingredients in separate bowl. Add dry ingredients into wet ingredients. Mix thoroughly. Pour mixture into parchment lined loaf pan. Sprinkle (or mix in) chocolate chips. Bake for 35-45 minutes on 350 or until fully cooked.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}, {"id": "674231c51435b762a129c1ef", "title": "8-minute Air fryer Dumplings", "ingredients": ": 1 lb ground chicken (or turkey) 1 egg 1 tsp cayenne 1/4 c coconut amino (or soy sauce) salt and pepper 2 stalks green onion chopped 12 Rice paper wrappers cut in half", "directions": ": Mix following ingredients in one bowl Cut rice wrappers into small squares, soak for 15 sec in cold water, and fill each rice wrappers with a spoonful of ground turkey mixture. Double wrap each dumpling with a second square of rice paper. Air fry on 390 F for 8 minutes or until fully cooked. Dunk in your favorite sauce and enjoy!", "category": "lunch", "macros": {"calories": 650, "protein": 40, "carbs": 75, "fat": 10}}, {"id": "674236b503d30c10162652d3", "title": "Salted Maple Butter Matcha", "ingredients": ": 35-40g hot water 2 overflowing tsp of matcha 1-2 tsp maple butter 1 tsp salt 1/4 c soy milk 1/4 c almond or oat milk", "directions": ": Froth or whisk matcha and water. Add maple butter and salt and continue to whisk/froth. P our matcha mixture over ice &amp; 1/4c milk Use remaining milk to collect remaining matcha mixture from mug and pour over ice. 5. Stir &amp; Enjoy", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6742389d82f8de7a5175b72e", "title": "Harvest Grain Bowl", "ingredients": ": 1 cup Tricolored Quinoa 2 cups B one broth 4 C hicken sausage links 1 cup B roccoli, chopped 1 large S weet potato 2 G reen onion stalks, chopped 1/2 oz A lmonds 1 TBSP O live oil S alt &amp; pepper to taste", "directions": ": Cook quinoa according to package instructions. Use bone broth in place of water. Cut sweet potatoes into cubes and microwave on high for 4 minutes to soften. Slice chicken sausages into rounds and place on sheet pan with sweet potatoes and broccoli. Toss in oil, salt, and pepper. Bake chicken sausage, sweet potato, and broccoli at 400 degrees for 20-25 minutes. While ingredients are cooking, chop green onion into small rounds and crush a handful of almonds. When finished cooking, scoop quinoa into dish. Serve chicken sausage, sweet potatoes, and broccoli over quinoa. Top with chopped green onion and sliced almonds", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67425367d9e5a2196bb9ea19", "title": "3 Ingredient Fish Tacos", "ingredients": ": 24oz Tilapia (6oz per serving) 1 bag tri-color cole slaw 12 small tortillas Optional: squeeze of lime", "directions": ": Pan fry tilapia in cooking oil of choice. Chop/separate fish into small pieces as it cooks. Add fish taco seasoning packet or seasoning of choice. In separate pan, brown cole slaw in cooking oil for 5-10 minutes or until lightly browned. Heat mini tortillas on additional pan until warm. Stuff tortillas with fish and cole slaw. Top with lime juice if desired!", "category": "dinner", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "674322e3f667ab6a16bc3688", "title": "Jack-O-Lantern Stuffed Peppers", "ingredients": ": 4 large bell peppers (any color) 1 cup cooked rice (white, brown, or your choice) 1 lb ground beef 1 medium onion, diced 1 small bell pepper (any color), diced 2 cloves garlic, minced 1 tsp smoked paprika 1 tsp dried oregano 1/2 tsp chili powder (optional, for a kick) Salt and pepper to taste 1 cup shredded cheese (cheddar, mozzarella, or your choice) 1 can (14 oz) diced tomatoes (drained) 2 tbsp olive oil", "directions": ": P reheat your oven to 375°F (190°C). Cut the tops off the large bell peppers and remove seeds and membranes. Lightly brush the insides with olive oil and set them in a baking dish. Heat 1 tbsp olive oil in a large skillet over medium heat. Add the ground beef, breaking it up with a spoon, and cook until browned (about 5 minutes). Add the onion, diced bell pepper, and garlic, cooking until softened (about 3–4 minutes). Stir in the smoked paprika, oregano, chili powder (if using), salt, and pepper. Stir in the cooked rice and drained diced tomatoes. Mix well and cook for 2–3 minutes to let the flavors meld. Taste and adjust seasonings if necessary. Spoon the beef and rice mixture into each bell pepper, packing it firmly but not overfilling. Top each stuffed pepper with a generous sprinkle of shredded cheese. Cover the baking dish with foil and bake for 25 minutes. Remove the foil and bake for an additional 10 minutes, or until the peppers are tender and the cheese is bubbly and golden. Let the stuffed peppers cool slightly before serving. Tips: For extra flavor, add a splash of Worcestershire sauce or soy sauce to the filling. Swap ground beef for turkey or plant-based crumbles for a variation. Make it saucier by mixing 1/4 cup of tomato sauce into the filling before stuffing.", "category": "dinner", "macros": {"calories": 800, "protein": 42, "carbs": 75, "fat": 35}}, {"id": "67433a5f0be60558631a3e66", "title": "Korean BBQ Rice Bowl", "ingredients": ": 1.5 pounds shaved steak 1 cups brown rice uncooked 1 small egg plant, diced or cut as desired 1 onion, sliced 2 heads of broccoli 1 TBSP Olive oil 2 tsp garlic powder salt and pepper to taste 1 bunch green onions, chopped (optional topping) 1 avocado, sliced (optional topping) Steak Marinade Ingredients: 1/2 coconut aminos 1 TBSP honey 2 TBSP olive oil", "directions": ": Preheat the oven to 375 degrees. Cook brown rice as directed on packaging. Cut eggplant and broccoli as desired and spread on the roasting sheet. Add olive oil, salt, pepper, and garlic power over veggies and toss to combine. Roast veggies for 30 minutes. In a small bowl combine coconut aminos, honey, olive oil, Cut steak to desired sized pieces and place in marinade. On medium heat, place steak in a pan and cook until done. Remove steak from pan and add onions to the same heated pan. Cook onions until soft and caramelized. Optional: Top bowl with green onions and avocado For a delicious Korean BBQ bowl place rice on bottom and layer serving of eggplant, broccoli, and onions. Add shredded steak and top with green onions and avocado.", "category": "lunch", "macros": {"calories": 850, "protein": 35, "carbs": 75, "fat": 40}}, {"id": "674342f2864ce56c1ca56731", "title": "Green Goddess Chicken Wrap", "ingredients": ": 1 tortilla (can opt for gluten free) 1/2 avocado 1/4 cucumber 4 oz chicken 1/2 cup spinach oregano to taste salt to taste", "directions": ": Pre-cook chicken Smash avocado on a tortilla Sprinkle salt and oregano on smashed avocado Add 4 ounces to chicken on top of avocado Add chopped cucumbers and spinach to wrap Roll tortilla with ingredients inside until a tight wrap Brown on stovetop for 1 minute on each side", "category": "lunch", "macros": {"calories": 600, "protein": 40, "carbs": 30, "fat": 25}}, {"id": "6743451182f8de7a51a3e090", "title": "Coffee Date Smoothie", "ingredients": ": 1 small frozen banana 2 dates 1 scoop of ice cubes 1 cup unsweetened almond milk 1 double espresso shot 1 TBSP date syrup (mixed into espresso shot) 2 spoonfuls of coconut yogurt 1 serving collagen powder Cinnamon 1 tsp vanilla Optional: 1 TBSP white miso paste", "directions": ":", "category": "smoothie", "macros": {"calories": 250, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "674346fa8f6d70252188f19b", "title": "Chicken Pad Thai", "ingredients": ": olive oil for cooking 12oz chicken breasts (seasoned with S&amp;P) 1 egg 2 cups mixed veggies (I used water chestnuts, bell peppers, and broccoli) 1 cup edamame 4 oz pad Thai noodles 1 avocado (optional topping) Sauce: 3 TBSP coconut aminos (sub soy sauce &amp; maple syrup) 1 tsp minced ginger 1 TBSP lime juice", "directions": ": Cook chopped chicken in olive oil on low to medium heat in a large pan or wok. Add egg once chicken is cooked partially through. Add mixed veggies and put lid on pan. While vegetables are cooking, add pad Thai noodles to a separate pot of boiling water. Follow instructions on noodle package. When noodles are fully cooked, add to pan and combine. Pour sauce over mixture and toss ingredients to mix. Serve and enjoy!", "category": "dinner", "macros": {"calories": 600, "protein": 40, "carbs": 30, "fat": 25}}, {"id": "674347a2585d7048617ae763", "title": "Tofu Scramble Wrap", "ingredients": ": 4oz tofu 1oz dairy free shredded cheese (or sub regular cheese) 1 tortilla (gluten free or regular) salt to taste pepper to taste cumin to taste paprika to taste oregano to taste Olive oil", "directions": ": Crumble tofu into small pieces Season tofu with salt, pepper, cumin, paprika, and oregano to taste. Oil pan and cook tofu on stovetop at medium heat or until lightly browned. Heat tortilla Add dairy free cheese and tofu to wrap and roll into burrito. Brown burrito on stovetop until slightly crispy.", "category": "lunch", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "6743483b8f3d255e88fb8b03", "title": "Baked Spaghetti Squash", "ingredients": ": 1 whole spaghetti squash 1 package chicken sausage marinara sauce parmesan cheese", "directions": ": Cut spaghetti squash in half and remove seeds. Drizzle/spray inside of squash with your choice of oil. Sprinkle with salt and pepper. Place both spaghetti squash halves face down on a sheet pan and bake for 40-45 minutes at 400 degrees. Add sliced chicken sausages to oiled pan. Cook on stovetop at medium heat until browned. Add marinara sauce to pan and heat until warm then set to simmer. Remove squash from oven and let cool. Using a fork scrap inside of squash until noodle like pieces are formed. Add sauce and sausage mixture to inside of squash halves. Top with cheese and enjoy!", "category": "lunch", "macros": {"calories": 550, "protein": 47, "carbs": 30, "fat": 20}}], "categories": {"breakfast": [{"id": "676f4ef7ce70df2eea39f89c", "title": "Gingerbread Baked Oats", "ingredients": ": 1/3 c oat milk (sub almond) 1 scoop vanilla protein or collagen 1/2 c oats 1 egg 1/2 tsp baking powder 1/2 tsp vanilla 2 TBSP maple syrup 1/2 tsp ginger 1 tsp all spice 1/2 tsp nutmeg 1/2 tsp salt", "directions": ": Preheat oven to 350 degrees F. Blend all ingredients in blender. Pour into oven safe dish. Bake at 350 degrees F for 25-30 mins. This recipe is gluten and dairy free. To make IBS friendly/low FODMAP, sub almond milk for oat milk.", "category": "breakfast", "macros": {"calories": 450, "protein": 15, "carbs": 55, "fat": 10}}, {"id": "6774002d0f1dd043b4aaeb4e", "title": "Egg Nog French Toast", "ingredients": ": 3 slices bread (Dave's Killer Powerseed used in Cronometer; opt for Gluten free bread if needed) 1/2cup oat nog 1/3 cup egg whites 1 serving collagen 1 tsp nutmeg 1 Stevia packet 1/2 tsp Cinnamon", "directions": ": Slice bread into cubes. Mix egg whites, oat nog, spices, collagen, and stevia in a bowl. Place cubed bread into oven safe dish. Pour liquid mixture over bread. Bake at 400 degrees F for approximately 20 minutes or until lightly browned. Top with nutmeg and syrup!", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67744f8789df4e73758bec96", "title": "Single Serve Hot Cocoa Protein Pancakes", "ingredients": ": 1 banana (115g) 3 TSBP Oats 110 g egg whites 1 scoop chocolate protein powder 1/4 tsp baking soda 1/4 tsp salt Optional Toppings: Marshmallows Maple syrup (Toppings not included in Cronometer recipe)", "directions": ": Blend ingredients in blender. Heat non-stick pan on low. Spoon batter onto pan, making pancakes of desired size. Flip pancakes when batter starts to bubble. Finish cooking to desired texture. This recipe is gluten and dairy free. Make this recipe IBS Friendly by using a firm (yellow-green) banana. If using vanilla protein powder, add 2 TBSP cocoa powder to blender!", "category": "breakfast", "macros": {"calories": 700, "protein": 35, "carbs": 75, "fat": 15}}, {"id": "6786d2f7bf52fe710e1b5694", "title": "Meal Prep Breakfast Burritos", "ingredients": ": 6 large tortillas (whole wheat or low-carb options for extra fiber) 6 large eggs 1 cup egg whites 1 cup shredded cheese (cheddar, Monterey Jack, Mozzarella, or your favorite variety) 1 lb ground turkey sausage 1/2 tsp salt 1/2 tsp black pepper 1/2 tsp paprika 1/4 tsp garlic powder Cooking spray or 1 tsp olive oil", "directions": ": Cook the Turkey Sausage Heat a skillet over medium heat. Spray with cooking spray. Add turkey sausage and cook until browned and fully cooked, about 8–10 minutes. Season with smoked paprika and garlic powder. Set aside. Prepare the Eggs In a mixing bowl, whisk together eggs and egg whites with salt and pepper. In the same skillet (wipe clean if needed), lightly spray with cooking spray and pour in the egg mixture. Cook on low-medium heat, stirring gently to create soft scrambled eggs. Remove from heat. Combine the eggs, turkey sausage, and cheese in a bowl. Stir to combine. Assemble the Burritos Lay out each tortilla. Add a portion of the mixture (~3/4-1 cup) to the center of each tortilla. Wrap the Burritos Fold the sides of the tortilla over the filling, then roll tightly from bottom to top to form a burrito. Repeat with all tortillas. Optional: Briefly brown the seam-side of each burrito in the skillet to help seal it shut. Store for Meal Prep Fridge : Wrap each burrito in foil or parchment paper and store in an airtight container. Refrigerate for up to 5 days. Freezer : Wrap burritos individually in plastic wrap, then foil, and place them in a freezer bag. Freeze for up to 3 months. Reheat Before Eating From the fridge: Microwave for 1–1:30 minutes, flipping halfway. From the freezer: Microwave for 3–4 minutes, flipping halfway. These burritos are great on their own or dipped in salsa. You can pair them with fresh fruit for a complete breakfast. Need extra calories? Swap egg whites for whole eggs, add more cheese, or mix in veggies like sautéed bell peppers or spinach. Enjoy your delicious, protein-packed breakfast burritos!", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "67ab628eebcbb403ed0d02de", "title": "Sheet Pan BBQ Chicken with Roasted Veggies", "ingredients": ":", "directions": ": Preheat oven to 400°F (200°C) and line a sheet pan with parchment paper. Mix BBQ sauce, olive oil, and seasonings in a bowl. Coat the chicken and set aside. Toss sweet potatoes with olive oil, salt, and garlic powder. Spread on the sheet pan and roast for 15 minutes. Remove the pan, place the chicken in the center, and add broccoli and bell pepper tossed with olive oil, salt, and pepper. Roast Everything Together for 20-25 minutes until the chicken reaches 165°F, sweet potatoes are tender, and veggies are slightly charred. Let the chicken rest for 5 minutes, then slice. Drizzle with extra BBQ sauce, garnish, and serve with lemon wedges. Great for meal prep with a side of quinoa, brown rice, or extra greens!", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67b750547d6e2c08347da2f1", "title": "Sheet Pan Garlic Shrimp and Roasted Veggies", "ingredients": ": 1 lb shrimp, peeled and deveined 2 yellow onions, peeled and sliced 2 cups broccoli florets 2 red bell peppers, thinly sliced Lemon (for serving) 1/4 cup avocado oil 2 TBSP minced garlic 1 tsp. crushed red pepper flakes Salt to taste Ground black pepper to taste", "directions": ": Preheat oven to 400°F (200°C) and line a sheet pan with parchment paper. Mix in a medium size bowl avocado oil, garlic, red pepper flakes, parsley, salt and pepper. Toss in shrimp and set aside to marinate. Toss onions, broccoli, and red peppers with a drizzle or spray of avocado oil and season with salt and pepper. Spread on the sheet pan and roast for 20 minutes. Remove the pan, pour shrimp and marinade over roasted veggies. Spread out in a single layer and roast for an additional 5 minutes or until shrimp is pink. If shrimp are still slightly frozen roast longer ~10min. Serve with a lemon wedge. Great for meal prep with a side of whole wheat pasta, brown rice, quinoa, or greens.", "category": "breakfast", "macros": {"calories": 450, "protein": 15, "carbs": 30, "fat": 25}}, {"id": "67fd416fe836cd766f950c6a", "title": "Hashbrown Egg Casserole with Feta, Spinach & Sundried Tomatoes", "ingredients": ": 12 large eggs 3 cups frozen hashbrowns , thawed 1 block feta cheese , cubed 2 cups fresh spinach , chopped ½ cup sundried tomatoes , chopped (drained if oil-packed) 1 small onion , diced Salt and pepper , to taste Olive oil or cooking spray , for greasing", "directions": ": Preheat oven to 425°F . Grease a 9x13-inch baking dish (or use two smaller ones if needed). spread the thawed hash brown in the bottom. If still frozen bake for ~5-10 minutes. In a large mixing bowl, whisk the 12 eggs thoroughly. Add salt, pepper, and any optional seasonings. Pour over hashbrowns. Top with feta, spinach, sundried tomatoes, and diced onion . Bake for 20-30 minutes , or until the eggs are set. Let cool for 10 minutes before slicing and serving.", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a8caff5a0a972a9c5b12f", "title": "Broccoli Cheddar Egg Muffins", "ingredients": ": 1 cup broccoli, chopped 1/4 cup diced onion 5 slices of turkey bacon 8 eggs 1/2 cup low fat shredded cheese 1 tbsp olive oil 1/2 tsp garlic powder 1/4 tsp salt 1/4 tsp pepper", "directions": ": Preheat the oven to 400 ° F. Cook turkey bacon according to package instructions and then cut up into small pieces. Add olive oil, broccoli, onion, salt, garlic powder, and pepper to a pan and sauté over medium heat. In a bowl, whisk the eggs, bacon, and cheese. Pour pan contents into the bowl and mix throughly. In a six count muffin tin, distribute mix evenly and bake for 15-20 minutes or until completely cooked.", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a8dd67dfdf95e57d907d8", "title": "Tater Tot Breakfast Casserole", "ingredients": ": 1 lb. turkey sausage 1.5 cups egg whites 1.5 cup low fat cottage cheese 6 servings of tater tots (504 g) 1/2 cup shredded cheddar cheese 1/2 tsp salt 1/2 tsp pepper 1/2 tsp garlic powder", "directions": ": Preheat oven to 375 ° F degrees. Spray a casserole dish with cooking grease and set aside. Heat a skillet over medium-high heat. Brown turkey sausage and drain excess grease from skillet. Set aside. In a blender, add egg whites, cottage cheese, and seasonings. Blend until creamy. Pour the blended egg mixture into the bottom of the greased casserole dish and add the cooked turkey sausage. Sprinkle ½ of the cheese across the top. Evenly distribute the tater tots across the top of the casserole and add the remaining cheese. Bake at 375 ° F for 40 mins.", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671f9aa24cae162e91adf78a", "title": "Healthier Egg Salad", "ingredients": ": 4 large hard-boiled eggs 4 tsp Primal Kitchen Mayonaise 1/2 tsp Dijon mustard 2 tbsp chives or scallions 1/2 tsp sea salt 1/2 tsp pepper", "directions": ": Chop eggs. Combine with mayonnaise, mustard, chives, salt, and pepper.", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671f9c314377251cbfac8be8", "title": "Banana Oat Cookies", "ingredients": ": 2 cup oats 1/2 tsp cinnamon 1/4 tsp salt 1/2 cup creamy peanut butter (or other nut butter) 1/2 tsp vanilla extract 2 large ripe bananas 1/4 cup dark chocolate chips 1 tbsp chia seeds", "directions": ": Preheat oven to 350°F. Line a baking sheet with parchment paper. In a large bowl, combine all ingredients, stirring until well mixed. Place 2 tablespoon sized scoops onto the baking sheet. Flatten slightly, forming the shape of a cookie. Bake for 14-17 minutes, or until the edges begin to brown. Remove from the oven and cool.", "category": "breakfast", "macros": {"calories": 600, "protein": 15, "carbs": 75, "fat": 15}}, {"id": "67339977ca5692403d72d2c2", "title": "Strawberry Overnight Oats", "ingredients": ": ½ cup oats 1 scoop strawberry protein powder ¾ cup unsweetened almond milk (can sub cow’s milk or other plant-based milk) ½ cup strawberries", "directions": ": In a mason jar, add oats, scoop of protein, and unsweetened almond milk. Tighten the lid and shake until the protein powder, oats, and milk combine. Open jar and top with strawberries. Place your jar in the refrigerator for at least 2 hours or overnight. Stir before eating and enjoy!", "category": "breakfast", "macros": {"calories": 550, "protein": 35, "carbs": 55, "fat": 10}}, {"id": "67376bc4ee18a17ac4e6d5cc", "title": "Roasted Sausage & Veggie Medley", "ingredients": ": 1 pack (1lb) Aidell’s chicken apple sausage (or your favorite sausage), cut into 1-inch rounds 1 lb Brussels sprouts, trimmed and halved 2 sweet potatoes, cubed 1 honey crisp apple, diced", "directions": ": Preheat your oven to 425°F and line a large baking sheet. Spread the Brussels sprouts, sweet potatoes, honey crisp apple, and chicken apple sausage on the pan in a single layer. Whisk together the marinade ingredients, then pour over the veggie and sausage mix. Use your hands to mix well and coat everything evenly. Roast mixture in a single layer for 20 minutes, tossing halfway through, until everything is browned and tender. Enjoy!", "category": "breakfast", "macros": {"calories": 600, "protein": 40, "carbs": 60, "fat": 10}}, {"id": "67433f07bd2a08017d3a8cc3", "title": "Egg Roll in a Bowl", "ingredients": ": 1lb ground turkey 1 packet raw cole slaw 2 TBSP coconut amino (sub soy sauce &amp; maple syrup) 1 TBSP olive oil", "directions": ": Oil pan. Cook ground turkey in pan on medium heat. Add 1 pack of cole slaw to pan and cover. Cook on medium heat until slaw is lightly browned. Add coconut amino sauce as desired.", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6750718a557b15543b77f295", "title": "Sugar Cookie Overnight Oats", "ingredients": ": ½ cup oats 1 cup soy milk (unsweetened) 1 scoop vanilla protein (Kion clean protein) 1 serving collagen (optional, included in Cronometer recipe) 1/8 tsp vanilla extract 1/8 almond extract 1 dash of salt 1 tsp maple syrup As many sprinkles as the hear desires (1 tsp added in Cronometer recipe)", "directions": ": Mix all ingredients in an air tight container. Store in fridge overnight. Remove from fridge, add sprinkles, and enjoy.", "category": "breakfast", "macros": {"calories": 600, "protein": 15, "carbs": 75, "fat": 15}}, {"id": "675745fead49685c1ad25d28", "title": "Egg Nog Latte", "ingredients": ": Double espresso of choice 1/2 c egg nog of choice (Almond Malk Holiday Nog used in Cronometer recipe) As much nutmeg as the heart desires", "directions": ": Brew double espresso in mug. While brewing espresso, froth 1/2 c egg nog. Pour frothed nog over espresso. Top with nutmeg. Enjoy hot or over ice. For high protein, choose cow’s milk or soy based egg nog or add in 1 serving of collagen.", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "675747751b44df1fb7b3d111", "title": "Oat Nog Ninja Creami", "ingredients": ": 1 1/2 c Chobani oat nog + 3 TBSP for mix in 1 serving collagen 1 scoop vanilla protein 1/2 tsp nutmeg", "directions": ": Add oat nog, collagen, vanilla protein, and nutmeg to Ninja Creami pitcher. Froth or blend contents to mix. Place lid on container and freeze for at least 24 hours. Place container in Ninja Creami and run on “lite ice cream” selection. Add 3 TBSP oat nog and press ‘’re-spin” Remove from machine &amp; enjoy!", "category": "breakfast", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "675999b2dd986b13f3766eba", "title": "Winter Spiced Overnight Oats", "ingredients": ": ½ cup oats ¾ cup unsweetened almond milk 1 scoop vanilla protein (Kion clean protein) 1 TBSP collagen (optional, included in Cronometer recipe) 1 tsp maple syrup ¼ tsp nutmeg ½ tsp cinnamon 1 TBSP dried cranberries 1 TBSP chopped pecans", "directions": ": Mix oats, protein powder, collagen, cinnamon, nutmeg maple syrup, and almond milk together. Store in fridge overnight or for a few hours. Remove from fridge, top with dried cranberries, chopped pecans, and enjoy!", "category": "breakfast", "macros": {"calories": 450, "protein": 15, "carbs": 55, "fat": 10}}, {"id": "675f8a69ef4418097634740f", "title": "Gingerbread Protein Pancakes", "ingredients": ": 1 (115g) banana 110g egg white 1 scoop vanilla protein powder 2 TBSP oat flour 1 tsp all spice 1 tsp nutmeg 1/2 tsp ginger 1/8 tsp baking powder", "directions": ": Blend ingredients in blender. Heat non-stick pan on low. Spoon batter onto pan, making pancakes of desired size. Flip pancakes when batter starts to bubble. Finish cooking to desired texture.", "category": "breakfast", "macros": {"calories": 550, "protein": 35, "carbs": 50, "fat": 15}}, {"id": "67684ce922d2f137d6bd8f4e", "title": "Sweet Potato Toast", "ingredients": ": 1 large sweet potato Avocado Spray cooking oil Toppings of choice", "directions": ": Cut sweet potato into thin slices. Spray slices with oil. Cook at 400 degrees F for 15-20 minutes or until lightly browned. Add toppings of choice.", "category": "breakfast", "macros": {"calories": 600, "protein": 15, "carbs": 60, "fat": 25}}, {"id": "670fe0ce3ee9f70713754887", "title": "Almond Joy Overnight Oats", "ingredients": ": 1/3 cup oats 1/4 cup unsweetened almond milk 1/3 cup coconut Greek yogurt 1 scoop chocolate protein powder 1/2 tbsp shredded coconut 1 tbsp dark chocolate chips 1/2 tsp cocoa powder 1/2 tbsp sliced almonds", "directions": ": In a mason jar, add the almond milk and protein powder. Tighten the lid and shake it so the protein powder combines with the milk. Add other ingredients. Close the lid and shake to combine. Place your jar in the refrigerator for at least 2 hours or overnight. Stir before eating and enjoy!", "category": "breakfast", "macros": {"calories": 650, "protein": 50, "carbs": 55, "fat": 10}}, {"id": "670fe49951592f74d1b4a050", "title": "Healthier Breakfast Burrito", "ingredients": ": 1 whole wheat tortilla 2 scrambled eggs 1/4 cup turkey sausage 1/4 cup shredded cheddar cheese 1/2 cup spinach", "directions": ": Cook the eggs and sausage first in separate pans. Add the spinach in the pan with the eggs. Once those are cooked, heat the tortilla in the microwave for 5 seconds. Then build the burrito using eggs with spinach first, then sausage, and adding cheese on top. Fold tightly and enjoy!", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a6c3dfa68bb6871901443", "title": "Healthier Breakfast Sandwich", "ingredients": ": 1 Multigrain English Muffin 3 tbsp egg whites, cooked 1 light Laughing Cow cheese wedge 1 Turkey Sausage patty", "directions": ": For the egg whites, use a muffin pan and pour 3 tbsp in each tin. Bake for 10 minutes at 350°F. While those are cooking, heat the English muffin and cheese in a toaster oven and microwave the turkey sausage patty according to the package directions. Then stack the egg white muffin and sausage patty on the English muffin.", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a6d57a1b4411b8077af64", "title": "Spinach & Cheese Egg Muffins", "ingredients": ": 1 cup egg whites 1/2 cup spinach, chopped 1/2 cup shredded mozzarella cheese Dash of sea salt and pepper", "directions": ": Preheat the oven to 350℉. Spray a 6 muffin tin with cooking spray. Mix egg whites, cheese, spinach, and salt and pepper. Pour mixture evenly among tins. Cook for 18 minutes or until the eggs are cooked all the way through. Let cool before eating. Enjoy!", "category": "breakfast", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671a8bd7fb164a4a47fc12a4", "title": "Blueberry Breakfast Bake", "ingredients": ": Base: 2 cups old fashioned oats 1/2 cup almond butter 2 large bananas 1/2 cup blueberries 1/4 cup hazelnuts Topping (optional): 1/2 cup Swerve sweetener 2 tbsp coconut milk", "directions": ": Preheat the oven to 350 °F. In a large mixing bowl, combine all base ingredients, and mix well. Bake for 20-25 minutes, or until completely cooked. Remove from the oven and allow it to cool in the pan for 15 minutes, before carefully transferring to a wire rack to cool completely. Once cool, drizzle the topping.", "category": "breakfast", "macros": {"calories": 450, "protein": 15, "carbs": 55, "fat": 10}}, {"id": "67412e020c59f53ba44ad890", "title": "Breakfast Quesadilla", "ingredients": ": 1 tortilla (can opt for gluten free if needed) 2 eggs and 1/4 c egg white Cheese (can opt for dairy free if needed) 2 breakfast maple chicken sausage links green onions (garnish)", "directions": ": Whisk two eggs and 1/4 c egg white in bowl. Pour whisked eggs into nonstick fry pan on low to medium heat. Cook eggs frittata style. While eggs are cooking heat tortilla on separate pan. Sprinkle cheese across tortilla. Add frittata on top of cheesy tortilla. Add an additional layer of cheese on top of frittata. Place halved sausages on top of egg on one half of tortilla. Fold tortilla in half to make into quesadilla. Heat both halves of the quesadilla until light brown. Cut in half and serve.", "category": "breakfast", "macros": {"calories": 550, "protein": 47, "carbs": 30, "fat": 20}}], "lunch": [{"id": "676f497158b82e752b9143dc", "title": "Candied Cranberries", "ingredients": ": 1 bag of fresh cranberries sparkling lemon or lime beverage of choice 3/4 c coconut sugar", "directions": ": Soak cranberries in sparkling beverage for 24 hours. Drain liquid from cranberries. Add coconut sugar and shake in container until all berries are coated. Place coated cranberries on sheet pan and bake for 8 minutes at 200 degrees F. Remove from oven. Let cool for 5 minutes. Place in freezer for 15 minutes. Throw into a serving dish and enjoy! This recipe is gluten and dairy free and can be made refined sugar free based on beverage selected. For refined sugar free options, choose mineral water and fresh lemon or lime juice! For a sweeter taste, sub powdered sugar for coconut sugar!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6773e18176b1b81d441e4a26", "title": "Roasted Maple Carrots", "ingredients": ": 1 bag of large carrots 3 TBSP Olive oil 3 TBSP Maple syrup 1 TBSP oregano 2 tsp Salt 1 tsp cinnamon 1 tsp thyme 1/2 tsp ginger", "directions": ": Peel and slice carrots. Coat in olive oil and maple syrup. Toss in seasonings. Spread seasoned carrots onto baking pan. Roast for 30 mins at 400 Degrees F", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67744ed0fe5d8014be06f1b3", "title": "Strawberry Santa Hats", "ingredients": ": Strawberries Oreo sandwich cookies or Trader Joe Joe’s if Gluten Free White chocolate Powdered sugar", "directions": ": Melt white chocolate in microwave. Heat in 30 second increments, stirring between each round until fully melted. Dip sandwich cookies in melted white chocolate. Make sure to cover both sides of cookies. Place a single strawberry immediately on top of dipped cookie. Scrap filling from one sandwich cookie and roll into balls for Santa hat topper. Top strawberry with ball of cream filling. Let cool in freezer for 10-15 minutes. Sprinkle with powder sugar and enjoy. #dessert #snack #glutenfree #seasonal #holiday #winter Instagram Reel", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "679250f91b90be6ae23eb1fa", "title": "Pomegranate Raspberry Fizz", "ingredients": ": 2 oz pomegranate juice 2 oz soda water 3 raspberries (plus extra for garnish) 1 sprig rosemary Ice", "directions": ": Rim the coupe glass with rosemary and chill if desired. Muddle raspberries with pomegranate juice in a shaker. Add ice, shake, and strain into the glass. Top with soda water. Garnish with raspberries and a rosemary sprig. Pro Tip : For extra flair, you can lightly torch the rosemary sprig before garnishing to enhance its aroma. Cheers! Enjoy your refreshing mocktail!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "679d1dedebf2aa6b1de6d8b3", "title": "Mediterranean Chicken Shawarma Bowls", "ingredients": ":", "directions": ": Marinate Chicken: In a bowl, mix oil, spices, and salt. Add chicken, toss to coat, and marinate for 30 minutes (or up to 3 hours in the fridge). Cook Rice: In a pot, bring rice, salt, and 3 cups water to a boil. Cover, reduce heat, and simmer for 15 minutes. Let sit for 10 minutes, then fluff with a fork. Cook Chicken: Spray the pan with oil and heat over medium-high heat. Cook chicken for 5-7 minutes per side until golden brown and 165°F internally. Let rest for10 minutes, then slice. Make Salad: In a bowl, combine cucumbers, bell peppers, onion, tomatoes, and feta. Add red pepper flakes, juice from 1 lemon, and 2 tsp. oil. Toss and season with salt. Assemble Bowls: Divide rice among bowls. Top with chicken, salad, a 1 TBSP of tzatziki sauce, 1 TBSP hummus. Serve with pita.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "679d1eabffb21e4ef5af76da", "title": "Slow-Cooker Korean Beef Rice Bowls", "ingredients": ":", "directions": ": In a 6-quart slow cooker, whisk together ginger, garlic, broth, brown sugar, soy sauce, gochujang, sesame oil, vinegar, and cornstarch. Add beef to the slow cooker and mix to coat. Cover and cook on high for 5-6 hours until beef is tender. Turn off slow cooker and let cool for 15 minutes. Skim excess fat from the surface, then stir the sauce. Shred beef with two forks and mix to combine. In a pot, bring rice, salt, and 4 cups water to a boil. Cover, reduce heat, and simmer for 15 minutes. Let sit for 10 minutes, then fluff with a fork. Serve: Spoon beef and sauce over cooked rice. Top with scallions, cilantro, and sesame seeds. Optional: Serve with steamed or roasted broccoli for added fiber, nutrients, and a well balanced meal", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "679d368c11bec651ddcb4df2", "title": "Deconstructed Burger Bowls", "ingredients": ":", "directions": ": Heat a skillet over medium-high heat. In a bowl, mix the ground beef with the spices until well combined. Then, form the mixture into four equal burger patties. Cook the patties for about 3-4 minutes per side, or until fully cooked through. Alternatively, you can cook the beef as crumbles by browning it in the skillet, breaking it up as it cooks. While the beef is cooking, prepare the special sauce by whisking all the ingredients together in a small bowl until well combined. Assemble the burger bowls by layering romaine lettuce as the base, followed by the cooked burger patties (or crumbled beef) and toppings of your choice. Drizzle the special sauce over everything and enjoy! Serving Suggestion: This dish pairs perfectly with roasted potatoes or homemade potato fries for a delicious and satisfying meal.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67ab65395dc8a56df6fc5431", "title": "Avocado Cucumber Salad", "ingredients": ": 2 avocados, chopped 2 small cucumbers, diced 1/2 cup crumbled feta cheese 1/2 cup fresh cilantro, chopped 2 green onions thinly, sliced 1 TBSP olive oil juice from 1 lemon 1 tsp salt", "directions": ": In a medium bowl, combine the avocados, cucumbers, feta, cilantro, and green onions. Add the olive oil and lemon juice and toss gently to mix. Season with salt.", "category": "lunch", "macros": {"calories": 550, "protein": 22, "carbs": 30, "fat": 35}}, {"id": "67b34fd549a09458d51e677b", "title": "Slow-Roasted Salmon Quinoa Bowl", "ingredients": ":", "directions": ": Preheat oven to 275°F (135°C) and line a baking sheet with parchment paper. Place salmon fillets on the baking sheet, drizzle with olive oil, and season with salt, pepper, garlic powder, and smoked paprika. Top salmon with lemon slices and slow roast for 30–35 minutes until tender and flaky. In a small bowl, mix vinegar, salt, and sugar until dissolved. Add cucumber slices and let sit for at least 15 minutes. In another bowl, whisk together Greek yogurt, dill, lemon juice, garlic, and olive oil. Thin with water if needed and season with salt and pepper. Divide cooked quinoa or rice into 4-5 bowls. Top with salmon, pickled cucumbers, red onion, and avocado. Drizzle with creamy dill dressing and garnish with fresh dill or lemon wedges if desired.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67c5f57354b52f4c45d08c9c", "title": "Grilled BBQ Chicken Bowls", "ingredients": ":", "directions": ": In a bowl, mix olive oil, BBQ sauce, garlic powder, paprika, salt, and pepper. Coat the chicken evenly and let it marinate for at least 15 minutes. Preheat the grill to medium-high heat. Grill the chicken for 6-8 minutes per side until fully cooked (internal temperature of 165°F). Let it rest for 5 minutes before slicing. In a large bowl, whisk together Greek yogurt, apple cider vinegar, Dijon mustard, salt, and pepper. Add the shredded cabbage and mix until well coated. Divide the cooked rice among five containers (1/2 cup per container) Top each with sliced BBQ chicken, a scoop of coleslaw, and sliced pickles. Drizzle with extra BBQ sauce if desired.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67d871e857ca2672c59159a9", "title": "Lemon Chicken Orzo Salad", "ingredients": ":", "directions": ": Whisk all dressing ingredients together in a small bowl. Season &amp; cook chicken (grill, pan-sear, or bake) until done. Let rest, then chop. Cook orzo and drain. Add veggies, feta, olives, &amp; herbs to the bowl. Add dressing and toss to combine. Top with chicken. Serve warm or chilled with fresh lemon wedges.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671a8f2c30da9777e243354b", "title": "Shrimp and Broccoli Stir Fry", "ingredients": ": 1 lb. shrimp, peeled and deveined 2 tbsp olive oil 2 tbsp agave or honey 2 tbsp reduced sodium soy sauce 1/2 tsp ginger 1 tbsp minced garlic 2 cups broccoli 2 cups brown rice", "directions": ": In a bowl, mix olive oil, agave, soy sauce, ginger, and minced garlic. Marinade shrimp in the sauce for 20 minutes. Steam broccoli and cook rice, set both aside. In a large skillet on medium high heat, pour shrimp and sauce into pan and sear for 2 minutes on each side. Add broccoli and rice and reduce heat to low. Cover and let sear for 5 minutes or until all sauce has been absorbed. Enjoy!", "category": "lunch", "macros": {"calories": 500, "protein": 15, "carbs": 75, "fat": 10}}, {"id": "671a918a6aa643149026f5f0", "title": "Southwest Chicken Salad", "ingredients": ": 24 oz. chicken tenderloins 1 cup black beans 1 cup red bell peppers 1 cup chickpeas 1 cup corn 1 cup cucumber, chopped 1 cup cooked shallot 1 cup jalapeno peppers, chopped 1 tbsp cilantro 1 cup low-fat shredded cheese 2 tbsp Primal Kitchen cilantro lime dressing 2 cups lettuce", "directions": ": Cook chicken, black beans, chickpeas, and shallots prior to assembling salad. Chop peppers and onions. In a large bowl, add cooked ingredients and chopped vegetables to lettuce. Toss with Primal Kitchen cilantro lime dressing.", "category": "lunch", "macros": {"calories": 550, "protein": 47, "carbs": 30, "fat": 20}}, {"id": "671a935ce5d7fa7996e0b622", "title": "Cheeseburger Wrap", "ingredients": ": 1 lb. 90% lean ground beef 1 tbsp Worcestershire sauce 2 tbsp sugar free ketchup 2 tbsp mustard 1 tsp minced onion 1 dash of salt and pepper 4 Joseph's Lavash bread sheets 1 cup shredded cheddar cheese 2 cups lettuce 1 cup tomatoes, chopped 1 red onion, chopped", "directions": ": Cook ground beef in fry pan. Add Worcestershire sauce, ketchup, minced onion, salt, and pepper to beef and stir. Lay Lavash bread sheets flat and sprinkle cheese on each. Add beef, lettuce, and tomato to Lavash bread. Wrap filling up in Lavash bread and heat on each side for 2-3 minutes or until lightly browned.", "category": "lunch", "macros": {"calories": 600, "protein": 42, "carbs": 30, "fat": 35}}, {"id": "671a98a3fb164a4a4700a09f", "title": "Creamy Butternut Squash Pasta", "ingredients": ": 2 cups butternut squash 3 tbsp olive oil 1/4 tsp salt 1/4 tsp black pepper 1/2 lb. turkey sausage, crumbled 4 garlic cloves, minced 6 oz. spinach 1 cup heavy cream 1/3 cup shredded parmesan cheese 8 oz. Banza bow tie pasta", "directions": ": Preheat oven to 400°F. In a large bowl, toss cubed butternut squash with 1 tbsp olive oil, salt, and pepper. Spread the squash on a parchment paper-lined baking sheet in one layer and roast for 30 minutes. In a medium skillet, heat 1 tablespoon of olive oil on medium heat. Add crumbled sausage to skillet and cook for about 10 minutes, regularly stirring, until the sausage is cooked through. Set aside. Cook pasta according to package instructions. Set aside. In a separate, large skillet, heat 1 tablespoon of olive oil together with minced garlic and spinach over medium heat and cook for about 5 or 7 minutes or until spinach starts to wilt. Add heavy cream to skillet until boiling, then immediately reduce to simmer. Add shredded Parmesan cheese to skillet continuing to stir on simmer until the cheese melts. Add cooked, drained pasta, cooked sausage, and butternut squash to the skillet with the creamy spinach sauce and stir to combine.", "category": "lunch", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "671f99746acd2952241016cf", "title": "Black Beans and Rice", "ingredients": ": 2 cups brown rice 1 tbsp olive oil ½ cup diced onion 1 medium diced bell pepper 1 ½ tsp minced garlic 3 cups reduced-sodium bone broth 1 can diced tomatoes 1 tbsp fresh chopped cilantro 2 tsp ground cumin 1 tsp chili powder ¼ tsp sea salt 2 can black beans, drained and rinsed 2 tbsp lime juice", "directions": ": Cook brown rice according to the package instructions. Heat the olive oil in a large skillet. Once oil is hot, add the onions, bell pepper, and garlic. Saute for 5 minutes. Add bone broth, cooked brown rice, beans, tomatoes, cilantro, cumin, chili powder, oregano, and salt to skillet. Stir. Bring to a boil on high heat then cover with the lid and reduce to simmer on medium low heat. Simmer for about 20-25 minutes, stirring occasionally. Stir in lime juice and let sit for 5 minutes. Serve and enjoy.", "category": "lunch", "macros": {"calories": 500, "protein": 15, "carbs": 75, "fat": 10}}, {"id": "671f9e92972d0056561143c4", "title": "Healthy Cinnamon Apples", "ingredients": ": 3 apples (about 3 cups, chopped) 2 tbsp water 1 tbsp coconut oil 1 tbsp honey (sub maple syrup) ½ tsp ground cinnamon ⅛ tsp sea salt ¼ tsp pure vanilla extract", "directions": ": Cut apples into cubes. Place apples pieces into a skillet with 2 tbsp water. Cover the pan and cook over medium heat for about 5 minutes, stirring occasionally, until the apples become slightly soft and water is absorbed. Add coconut oil to the skillet. Stir apples and oil together until all the apples are coated. Cook for 5 minutes, stirring every minute or so, until the apples become soft (If apples do not soften, cover apples for the last 2 minutes). Add honey (or maple syrup), cinnamon, salt, and vanilla to apple mixture. Stir until well mixed. Cook for about 5 more minutes, stirring every minute until the apples reach your desired softness!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671f9fa0fde28b5c62607911", "title": "Peanut Butter Chia Pudding", "ingredients": ": 2 tbsp chia seeds 1 cup cashew milk 2 tbsp powdered peanut butter 1/2 scoop vanilla protein powder", "directions": ": In a container with an airtight lid or a mason jar, pour cashew milk into container. Add in chia seeds, peanut butter powder, and protein powder. Put the top on the container and shake for 15 seconds. Put the container in the refrigerator for 1 hour. Take container out and shake it again for 15 seconds. Let sit for 3 more hours in the refrigerator before enjoying", "category": "lunch", "macros": {"calories": 400, "protein": 35, "carbs": 30, "fat": 10}}, {"id": "67413482585d7048611e4ae7", "title": "Homemade Peanut Butter Cups", "ingredients": ": For chocolate 1 cup dark chocolate 1 tsp coconut oil For filling 1/4 c natural PB 1/4 c oat flour 1 tsp vanilla 1 TBSP maple syrup", "directions": ": Pour dark chocolate and coconut oil in a microwave safe bowl. Microwave in 15-30 second increments, stirring between each, until chocolate is fully melted. Fill mold approximately 1/3 of volume with dark chocolate. Freeze 10-15 minutes or until chocolate layer is completely hardened. While chocolate is in freezer, mix PB, oat flour, vanilla, and maple syrup in a separate bowl until a thick dough like consistency. Take mold out of freezer, add a small portion of filling into each mold, pressing filling into the mold with your finger so that it is flat on top of the chocolate layer. Cover PB layer with melted chocolate in each mold. Freeze for 10-15 minutes or until chocolate is completely hardened. One by one, carefully pop each PB “cup” out of the mold and enjoy!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6741ce5f10e46d1419712b29", "title": "Pumpkin Spice Yogurt Parfait", "ingredients": ": 1 single serving of nonfat vanilla Greek yogurt yogurt 3 TBSP pumpkin 1 tsp pumpkin spice 1/3 cup granola 1 TBSP hemp seeds (for toppings) 1/2 TBSP almond butter (for toppings)", "directions": ": Mix the Greek yogurt, pumpkin puree, and pumpkin pie spice in bowl. Place granola at bottom of serving dish. Scoop yogurt mixture over granola. Top with toppings of choice. For higher protein options, choose nut butters, high protein granola, hemp seeds, chia seeds, or pumpkin seeds as toppers.", "category": "lunch", "macros": {"calories": 400, "protein": 30, "carbs": 30, "fat": 10}}, {"id": "6742575c864ce56c1c7ff472", "title": "3 ingredient baked tacos", "ingredients": ": 12 Corn tortillas 1lb G round turkey or beef 6 oz Shredded cheese (Opt for d airy free if desire) Optional: Green onion topping", "directions": ": Cook ground meat on skillet (season with taco seasoning as desired). Place corn tortillas on non stick sheet pan. Fill with meat and cheese. Fold tortillas into tacos. Place weighted object on tortillas to hold in place (e.g. metal spoon) Bake for 20 minutes at 400 degrees. Optional, top with green onion.", "category": "lunch", "macros": {"calories": 600, "protein": 42, "carbs": 30, "fat": 35}}, {"id": "674f20193ea64a54556c637b", "title": "Snow Globe Mocktail", "ingredients": ": 1 rosemary leaf Approx. 1/2 c or 1 handful of whole cranberries water Probiotic soda or beverage of choice", "directions": ": Prepare the Glass : Take one glasses and place a small handful of cranberries at the bottom. Prepare the Rosemary : Take a sprig of rosemary, turn it upside down, and trim the bottom so it’s even. Spread out the bottom leaves slightly to help it stand upright in the glass. Assemble the Glass : Place the rosemary sprig into the middle of the glass. Pour water into the glass, covering the cranberries and stabilizing the rosemary. Alternatively, pour water first, then position the rosemary sprig so it stays upright. Freeze : Set the glass on a small baking sheet for stability and place in the freezer. Freeze for about 45 minutes, or until the water is completely frozen. Serve : Remove the glass from the freezer and serve immediately. Pour your favorite sparkling water or probiotic drink over the frozen setup for a magical \"snow globe\" effect. Cronometer recipe uses a Cran fizz Poppi.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67520e9a664de650edca0624", "title": "Salted Peppermint Mocha", "ingredients": ": Mint Double espresso (sub for regular espresso with 1/8 tsp peppermint extract) Drink LMNT chocolate salt (sub for 1/4 tsp salt &amp; chocolate protein powder) 1/2 c choice of milk (Cronomter recipe uses fairlife ultrafiltered skim milk)", "directions": ": Mix (peppermint) double espresso with chocolate salt. Pour milk over ice. Pour espresso over milk &amp; ice. Stir and enjoy.", "category": "lunch", "macros": {"calories": 400, "protein": 35, "carbs": 30, "fat": 10}}, {"id": "675777f5a0b4f82fb333d981", "title": "Spiced Orange Cran Mocktail", "ingredients": ": Ice cubes 1 orange 1 pack of cranberries Mocktail base 2 oz orange sparkling beverage (Orange Poppi Prebiotic soda was used in the Cronometer recipe) 6 oz cranberry juice 1 cinnamon stick", "directions": ": Ice Cubes: Slice orange into rounds. Place one orange slice into each ice cube mold. Add a handful of cranberries into each mold. Pour water (Or beverage of choice) to fill mold. Freeze for at least 24 hours. Mocktail Place ice cube in glass. Pour orange sparkling beverage over ice. Add cranberry juice. Stir with cinnamon stick.", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "675a1b749045e814087c2962", "title": "Winter Chicken Bowl", "ingredients": ": 2 c kale 1 cooked chicken breast (4 oz) 3 oz cooked sweet potato (diced) 3 oz cooked broccoli 1/4 c pomegranate seeds 1-2 TBSP crushed almonds 2 TBSP balsamic glaze", "directions": ": Precook chicken, broccoli, and sweet potatoes in the oven. Fill bowl with pre-washed chopped kale. Add chicken breasts, roasted sweet potatoes, and broccoli. Sprinkle with pomegranate seeds and almonds. Finish it off with a few drizzles of balsamic glaze.", "category": "lunch", "macros": {"calories": 600, "protein": 40, "carbs": 60, "fat": 10}}, {"id": "675f84fdef7a185351acc810", "title": "High Protein “Snickers Salad”", "ingredients": ": 1 single serve container of vanilla greek yogurt (dairy free optional) 1 caramel chocolate protein bar of choice (gluten &amp; dairy free optional) 1 green apple 2 TBSP date syrup", "directions": ": Chop protein bar and apple into bite sized pieces. Line cup or bowl with date syrup. Layer apple, protein bar pieces, and yogurt into cup or bowl, adding in date syrup between layers as desired. Top with date syrup, stir, &amp; enjoy.", "category": "lunch", "macros": {"calories": 400, "protein": 30, "carbs": 30, "fat": 10}}, {"id": "671a6fe7fbef337c00acc8b6", "title": "Greek Turkey Burgers", "ingredients": ": Turkey Burgers: 24 oz ground turkey 1/2 cup reduced-fat feta cheese 4 tsp minced garlic 1 small red onion, diced 1 cup spinach 1/2 tsp oregano 1 tsp sea salt 1/2 tsp pepper Homemade Tzatziki: 1/4 cup fat-free Greek yogurt 1/2 tsp lemon juice 1 large sprig of dill 3-4 sliced pickles, diced", "directions": ": Combine all ingredients for the turkey burgers in a large bowl. Form into patties. On stove top, heat a large skillet and cook for 5 minutes, flip, then turn the heat to medium low. Cover for the next 5 minutes until all burgers are cooked. Preheat oven to 375 and cook for ~25 minutes. Serve with bun, fries, Greek salad, etc.", "category": "lunch", "macros": {"calories": 500, "protein": 37, "carbs": 30, "fat": 20}}, {"id": "671a76f5f1f98b4ffb86af42", "title": "Salmon Burger", "ingredients": ": 1 salmon fillet 2 tbsp dijon mustard 1 tbsp cilantro 1 tbsp parsley 1/2 tsp salt 1/2 tsp pepper 1/2 tsp paprika 1/4 cup breadcrumbs 1/2 tbsp olive oil", "directions": ": Cut the salmon fillet into 1-inch pieces. In a food processor or blender, add salmon cubes, mustard, herbs, salt, pepper, and paprika. Pulse until mixed together well. There should be some small chunks. Transfer salmon mixture to a medium-sized bowl. Add the breadcrumbs and mix with a spatula until combined. Evenly divide the salmon mixture into four portions (about 4-oz. each) then shape into patties. Cook on the stovetop over medium high heat until the fillet is golden brown. Flip and let it cook for a few more minutes.", "category": "lunch", "macros": {"calories": 480, "protein": 37, "carbs": 30, "fat": 20}}, {"id": "671a78c80270cf4c7d371e94", "title": "Mediterranean Wrap", "ingredients": ": 1 Joseph's Lavash Wrap 4 oz grilled chicken 10 g onion 30 g hummus 60 g tomatoes 30 g reduced-fat feta cheese 40 g cucumber 20 g pickles 40 g spinach 60 g homemade tzatziki sauce Homemade Tzatziki: 60 g fat-free Greek yogurt 1 g lemon juice 1 large sprig of dill 25 g diced pickles", "directions": ": Make Tzatziki sauce by mixing Greek yogurt, lemon juice, dill, and diced pickles into a small bowl. Set aside. Dice the tomatoes, cucumber, and pickles. Spread hummus on the lavash wrap. Layer onion, tomatoes, feta cheese, and thin slices of cucumber in the middle of the wrap. Slice the grilled chicken into strips. Add the pickles, spinach, and homemade tzatziki sauce. Wrap it up and enjoy!", "category": "lunch", "macros": {"calories": 650, "protein": 62, "carbs": 30, "fat": 20}}, {"id": "671a7e458e78834f3dbd762b", "title": "Blueberry Coconut Chia Seed Pudding", "ingredients": ": 1 cup unsweetened coconut milk 1/4 cup water 1 tsp vanilla extract 6 tbsp chia seeds 1.5 cup frozen blueberries 2 tbsp water", "directions": ": You will need a container with an airtight lid. A Mason jar works best. Pour coconut milk first. Then, add in the chia seeds, 1/4 cup water, and vanilla extract. Put the top on and shake it for 15 seconds. Add frozen blueberries and 2 tbsp water to a sauce pan and heat on medium. After about 3-5 minutes, smash the blueberries. Reduce the heat to medium-low to simmer for 10 minutes, stirring frequently. Once cooled, add the sauce on top of the chia pudding. Put the container in the refrigerator for 4 hours. Take it out and stir it up and enjoy!", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671a7f3d48582c7dd3420462", "title": "Roasted Brussels Sprouts with Balsamic Glaze", "ingredients": ": 1 lb Brussels sprouts, trimmed and halved 2 tbsp olive oil Salt and black pepper to taste 2 tbsp balsamic vinegar 1 tbsp honey or maple syrup (optional, for sweetness) 1-2 cloves garlic, minced (optional, for added flavor) 2 tbsp chopped fresh parsley (for garnish, optional)", "directions": ": Preheat the Oven: Preheat your oven to 400°F (200°C). Prepare Brussels Sprouts: Trim the ends of the Brussels sprouts and cut them in half. Place them in a large bowl. Seasoning: Drizzle olive oil over the Brussels sprouts, ensuring they are evenly coated. Season with salt and black pepper to taste. Add minced garlic if desired. Roast Brussels Sprouts: Spread the Brussels sprouts in a single layer on a baking sheet. Roast in oven for 20-25 minutes or until they are golden brown and crispy on the edges. Shake or stir them halfway through to ensure even cooking. Prepare Balsamic Glaze: While the Brussels sprouts are roasting, prepare the balsamic glaze. In a small saucepan, heat balsamic vinegar over medium heat. Optional: add honey or maple syrup for sweetness. Simmer for 5-7 minutes or until the vinegar has reduced by half and has a syrupy consistency. Combine and Glaze: Once the Brussels sprouts are done roasting, transfer them to a serving bowl. Drizzle the balsamic glaze over the roasted Brussels sprouts and toss them to coat evenly. Garnish and Serve: Optionally, garnish with chopped fresh parsley for a burst of freshness. Serve Warm: Serve the roasted Brussels sprouts with balsamic glaze immediately while warm. #side #recipes #seasonal #Thanksgiving #vegetables #sidedish #holiday", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671a8252f3c7c9218394a859", "title": "Thanksgiving Kale Salad with Roasted Butternut Squash", "ingredients": ":", "directions": ": Roast Butternut Squash: Preheat your oven to 400°F (200°C). Toss the diced butternut squash with a bit of olive oil, salt, and pepper. Spread the squash on a baking sheet in a single layer and roast for 20-25 minutes or until tender and golden brown. Allow it to cool. Prepare Kale: In a large bowl, massage the kale with a bit of olive oil for a few minutes until it becomes tender and dark green. Assemble the Salad: Add the roasted butternut squash, toasted pumpkin seeds, dried cranberries, and crumbled feta cheese (optional) to the massaged kale. Prepare the Dressing: In a small bowl, whisk together the olive oil, balsamic vinegar, maple syrup or honey, Dijon mustard, salt, and pepper. Dress the Salad: Pour the dressing over the salad and toss everything together until well coated. Chill (Optional): If time allows, let the salad chill in the refrigerator for 30 minutes to allow the flavors to meld. Serve: Serve the kale salad in a large bowl or on a platter, and sprinkle additional pumpkin seeds and cranberries on top for garnish if desired. #side #recipes #seasonal #Thanksgiving #salad #holiday #holidaymeal", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6733949d36d24c18d25b6f39", "title": "Healthy Chicken Salad", "ingredients": ": 1.5 lbs boneless skinless chicken breast ½ cup non-fat plain Greek yogurt ½ cup light mayo 1 cup celery, chopped 1 cup grapes, halved ¼ cup slivered almonds", "directions": ": Cook chicken breast. If using Instant pot : Place chicken breast in pot, add 1 cup of water, and any desired seasoning (salt, pepper, garlic powder, onion powder). Set Instant pot to pressure cook high for 10 minutes, release steam after 2-5 minutes. Shred chicken. Place cooked chicken breasts in a mixer and using the paddle attachment mix until shredded to desired consistency. Or shred manually with two forks. Mix the Greek yogurt and mayo Add in mix-ins: celery, grapes, almonds and mix. Chill and Enjoy!", "category": "lunch", "macros": {"calories": 550, "protein": 55, "carbs": 30, "fat": 10}}, {"id": "674231c51435b762a129c1ef", "title": "8-minute Air fryer Dumplings", "ingredients": ": 1 lb ground chicken (or turkey) 1 egg 1 tsp cayenne 1/4 c coconut amino (or soy sauce) salt and pepper 2 stalks green onion chopped 12 Rice paper wrappers cut in half", "directions": ": Mix following ingredients in one bowl Cut rice wrappers into small squares, soak for 15 sec in cold water, and fill each rice wrappers with a spoonful of ground turkey mixture. Double wrap each dumpling with a second square of rice paper. Air fry on 390 F for 8 minutes or until fully cooked. Dunk in your favorite sauce and enjoy!", "category": "lunch", "macros": {"calories": 650, "protein": 40, "carbs": 75, "fat": 10}}, {"id": "674236b503d30c10162652d3", "title": "Salted Maple Butter Matcha", "ingredients": ": 35-40g hot water 2 overflowing tsp of matcha 1-2 tsp maple butter 1 tsp salt 1/4 c soy milk 1/4 c almond or oat milk", "directions": ": Froth or whisk matcha and water. Add maple butter and salt and continue to whisk/froth. P our matcha mixture over ice &amp; 1/4c milk Use remaining milk to collect remaining matcha mixture from mug and pour over ice. 5. Stir &amp; Enjoy", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6742389d82f8de7a5175b72e", "title": "Harvest Grain Bowl", "ingredients": ": 1 cup Tricolored Quinoa 2 cups B one broth 4 C hicken sausage links 1 cup B roccoli, chopped 1 large S weet potato 2 G reen onion stalks, chopped 1/2 oz A lmonds 1 TBSP O live oil S alt &amp; pepper to taste", "directions": ": Cook quinoa according to package instructions. Use bone broth in place of water. Cut sweet potatoes into cubes and microwave on high for 4 minutes to soften. Slice chicken sausages into rounds and place on sheet pan with sweet potatoes and broccoli. Toss in oil, salt, and pepper. Bake chicken sausage, sweet potato, and broccoli at 400 degrees for 20-25 minutes. While ingredients are cooking, chop green onion into small rounds and crush a handful of almonds. When finished cooking, scoop quinoa into dish. Serve chicken sausage, sweet potatoes, and broccoli over quinoa. Top with chopped green onion and sliced almonds", "category": "lunch", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "67433a5f0be60558631a3e66", "title": "Korean BBQ Rice Bowl", "ingredients": ": 1.5 pounds shaved steak 1 cups brown rice uncooked 1 small egg plant, diced or cut as desired 1 onion, sliced 2 heads of broccoli 1 TBSP Olive oil 2 tsp garlic powder salt and pepper to taste 1 bunch green onions, chopped (optional topping) 1 avocado, sliced (optional topping) Steak Marinade Ingredients: 1/2 coconut aminos 1 TBSP honey 2 TBSP olive oil", "directions": ": Preheat the oven to 375 degrees. Cook brown rice as directed on packaging. Cut eggplant and broccoli as desired and spread on the roasting sheet. Add olive oil, salt, pepper, and garlic power over veggies and toss to combine. Roast veggies for 30 minutes. In a small bowl combine coconut aminos, honey, olive oil, Cut steak to desired sized pieces and place in marinade. On medium heat, place steak in a pan and cook until done. Remove steak from pan and add onions to the same heated pan. Cook onions until soft and caramelized. Optional: Top bowl with green onions and avocado For a delicious Korean BBQ bowl place rice on bottom and layer serving of eggplant, broccoli, and onions. Add shredded steak and top with green onions and avocado.", "category": "lunch", "macros": {"calories": 850, "protein": 35, "carbs": 75, "fat": 40}}, {"id": "674342f2864ce56c1ca56731", "title": "Green Goddess Chicken Wrap", "ingredients": ": 1 tortilla (can opt for gluten free) 1/2 avocado 1/4 cucumber 4 oz chicken 1/2 cup spinach oregano to taste salt to taste", "directions": ": Pre-cook chicken Smash avocado on a tortilla Sprinkle salt and oregano on smashed avocado Add 4 ounces to chicken on top of avocado Add chopped cucumbers and spinach to wrap Roll tortilla with ingredients inside until a tight wrap Brown on stovetop for 1 minute on each side", "category": "lunch", "macros": {"calories": 600, "protein": 40, "carbs": 30, "fat": 25}}, {"id": "674347a2585d7048617ae763", "title": "Tofu Scramble Wrap", "ingredients": ": 4oz tofu 1oz dairy free shredded cheese (or sub regular cheese) 1 tortilla (gluten free or regular) salt to taste pepper to taste cumin to taste paprika to taste oregano to taste Olive oil", "directions": ": Crumble tofu into small pieces Season tofu with salt, pepper, cumin, paprika, and oregano to taste. Oil pan and cook tofu on stovetop at medium heat or until lightly browned. Heat tortilla Add dairy free cheese and tofu to wrap and roll into burrito. Brown burrito on stovetop until slightly crispy.", "category": "lunch", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "6743483b8f3d255e88fb8b03", "title": "Baked Spaghetti Squash", "ingredients": ": 1 whole spaghetti squash 1 package chicken sausage marinara sauce parmesan cheese", "directions": ": Cut spaghetti squash in half and remove seeds. Drizzle/spray inside of squash with your choice of oil. Sprinkle with salt and pepper. Place both spaghetti squash halves face down on a sheet pan and bake for 40-45 minutes at 400 degrees. Add sliced chicken sausages to oiled pan. Cook on stovetop at medium heat until browned. Add marinara sauce to pan and heat until warm then set to simmer. Remove squash from oven and let cool. Using a fork scrap inside of squash until noodle like pieces are formed. Add sauce and sausage mixture to inside of squash halves. Top with cheese and enjoy!", "category": "lunch", "macros": {"calories": 550, "protein": 47, "carbs": 30, "fat": 20}}], "dinner": [{"id": "67424dcd4806e80a7abe0816", "title": "Maple Dijon Chicken", "ingredients": ":", "directions": ": Mix ingredients to make sauce Pour sauce over chicken in air tight container. Marinate chicken in fridge for 2-4 hours or overnight Add potatoes and green beans to pan and cover with olive oil, salt, and pepper. Add marinated chicken to pan. Bake for 30 mins at 400 degrees Fahrenheit or until chicken reaches internal temperature of 165 degrees Fahrenheit. Separate into 4-5 servings and store in fridge.", "category": "dinner", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "676df42bb017e94a8536ad4c", "title": "Butternut Squash Mac", "ingredients": ": 1 butternut squash 1/2 c nutritional yeast 1/4 c bone broth 6 stalks of green onion 1 tsp pepper 1 tsp salt (for non-IBS individuals) 1 head of garlic 150g of gluten free pasta 1 lb. 97% lean ground beef", "directions": ": Cut squash in half and roast squash for 45 minutes at 400 degrees F or until mushy. Let cool. (If you plan to add head of garlic, roast in oven with squash). Scoop out inside contents of squash and add to blender cup. Add nutrition yeast, broth, chopped green onion, and spices to blender. Blend until smooth. Pour over cooked beef and serve over pasta. For individuals with IBS, butternut squash is not a low FODMAP food however, it is considered to be low FODMAP when consumed in quantities less than approximately 2.65oz and can be tolerated in moderation. Note: garlic is also a high FODMAP food and should not be added if meal preparation is for individuals with IBS. Please note, individuals with IBS tolerate foods on a case by case basis and should work with a dietitian to determine specific dietary needs.", "category": "dinner", "macros": {"calories": 500, "protein": 35, "carbs": 30, "fat": 25}}, {"id": "6776e155c6828404bfb6a607", "title": "Instant Pot Chili", "ingredients": ": 1 yellow onion, chopped&nbsp; 3 cloves garlic, finely chopped&nbsp; 2 Tbsp tomato paste 2 lbs lean ground beef 2 cups beef bone broth 1 (15-oz.) can black beans, rinsed, drained 1 (15-oz.) can fire-roasted diced tomatoes 1 (15-oz.) can kidney beans, rinsed, drained 1 (15-oz.) can black eyed peas, rinsed, drained 1.5 Tbsp chili powder 1 tsp. dried oregano&nbsp; 1 tsp. ground cumin&nbsp; 1/2 tsp. cayenne Kosher salt Freshly ground black pepper Optional Toppings: Shredded cheddar cheese Sour cream or Greek yogurt for a high protein/low fat sub Fritos or corn chips Chopped green onions (Toppings not included in Cronometer recipe)", "directions": ": Sauté: Set Instant Pot to Sauté and cook onion, garlic, and ground beef until browned (5-7 minutes). If using ground beef with higher fat content, you may want to drain the fat. With ~93% lean beef, draining isn't necessary. Add Ingredients: Return the ground beef mixture to the pot. Add black beans, tomatoes, kidney beans, black-eyed peas, bone broth, spices, salt, and pepper. Lock the lid and Pressure Cook on High for 14 minutes. Release Pressure: Perform a quick pressure release, then open the lid once fully released. Serve: Divide chili into bowls and top with your favorite toppings. For Slow Cooker: Cook beef in a skillet, then transfer it along with all other ingredients to a slow cooker. Cook on Low for ~6 hours or High for ~3 hours.", "category": "dinner", "macros": {"calories": 700, "protein": 57, "carbs": 30, "fat": 35}}, {"id": "67e6abde31e1636b51eb181a", "title": "Sheet Pan Chicken Fajitas", "ingredients": ": 1 lb chicken breast, cut into strips 3 bell peppers (any color), cut into strips 1 red onion, cut into strips Avocado oil (spray or drizzle) 1 tsp salt ½ tsp black pepper 1 tsp paprika 1 tsp onion powder 1 tsp garlic powder", "directions": ": Preheat oven to 400°F (200°C). Spread chicken, bell peppers, and onion evenly on a sheet pan. Lightly coat with avocado oil and season with salt, pepper, paprika, onion powder, and garlic powder. Toss to coat evenly. Bake for 20-25 minutes, flipping halfway through, until chicken is fully cooked and veggies are tender. Serve with tortillas, rice, or on top of a salad! Add any of your favorite taco toppings/ avocado, salsa, cilantro, roasted corn, pickled onions, shredded cheese, fresh lime", "category": "dinner", "macros": {"calories": 600, "protein": 40, "carbs": 30, "fat": 25}}, {"id": "67f415fa86dbec59bcf5fcb8", "title": "Tropical Grill Kabobs", "ingredients": ": 1 lb chicken breast , cut into 1.5-inch chunks 1 lb steak (sirloin or flank), cut into 1.5-inch chunks 1 red bell pepper , cut into 1.5-inch pieces 1 yellow bell pepper , cut into 1.5-inch pieces 1 red onion , cut into 1.5-inch wedges 1 ½ cups pineapple chunks (fresh or canned in juice) Wooden skewers (about 10–12)", "directions": ": Soak the wooden skewers in water for at least 30 minutes to prevent burning on the grill. In a large bowl or zip-top bag , whisk together all marinade ingredients. Add the chicken, steak, bell peppers, onion, and pineapple to the marinade. Toss to coat evenly. Cover and marinate in the fridge for at least 1 hour , or up to 8 hours for deeper flavor. Preheat the grill to medium-high heat. Thread the marinated ingredients onto the soaked skewers , alternating between chicken, steak, veggies, and pineapple for a colorful presentation. Grill the kabobs for 10–15 minutes, turning every few minutes, until the chicken is fully cooked (165°F internal temp) and the steak reaches desired doneness. Remove from grill and let rest for a few minutes before serving. Serve over rice, quinoa, or with a side salad for a fresh summer meal. These kabobs are great for meal prep or BBQ gatherings!", "category": "dinner", "macros": {"calories": 650, "protein": 60, "carbs": 30, "fat": 25}}, {"id": "680bc9cb6bb6837ac0abc7b1", "title": "Slow Cooker Pork Carnitas", "ingredients": ": 2 pounds pork tenderloin or pork loin 1 tablespoon dried oregano 2 teaspoons ground cumin 1 tablespoon avocado oil ½ onion, chopped 3 garlic cloves, smashed 1 medium jalapeño, sliced (remove seeds for less heat) 2 teaspoons salt 2 tablespoons fresh lime juice ¼ cup orange juice", "directions": ": Assemble in slow cooker: Place the pork loin in the slow cooker. Add oregano, cumin, avocado oil, onion, garlic, jalapeño, salt, lime juice, and orange juice. Mix: Use tongs or clean hands to gently mix everything together, making sure the pork is coated evenly with the seasonings and juices. Cook: Cover and cook on HIGH for 4–6 hours or LOW for 6–8 hours , until pork is very tender and reaches an internal temp of 195°F . Shred: Shred the pork directly in the slow cooker using two forks. Stir to mix with the juices. Serve or store: Serve immediately, or let cool and store pork with juices in an airtight container in the fridge until ready to eat.", "category": "dinner", "macros": {"calories": 450, "protein": 15, "carbs": 30, "fat": 25}}, {"id": "671a9029740cc74a2e8a392e", "title": "Buffalo Chicken Casserole", "ingredients": ": 30 oz. chicken (cooked) 30 oz. frozen riced cauliflower 1/3 cup Primal Kitchen buffalo sauce 1 packet ranch seasoning 2 cups shredded cheese 8 oz reduced fat cream cheese", "directions": ": Preheat oven to 350 ° F. Microwave riced cauliflower according to package instructions. Combine all ingredients, including cooked cauliflower, in a large bowl and mix. Pour mixture into a casserole dish and bake for 35 minutes.", "category": "dinner", "macros": {"calories": 750, "protein": 47, "carbs": 75, "fat": 20}}, {"id": "671f8e003cd8c723b6b2ef75", "title": "Foil Baked Salmon and Asparagus", "ingredients": ": 2 salmon fillet (around 1 lb) 2 tbsps reduced sodium bone broth 2 tsp minced garlic 1.5 tbsp lemon juice ½ tsp salt ½ tsp pepper 2 tbsp avocado oil butter 2 tbsp parsley 1 lb asparagus (450 g)", "directions": ": Preheat your oven to 425℉. Prepare 2 aluminum foil sheets (14 x 12) on top of a baking sheet. In a small mixing bowl, combine bone broth, lemon juice, garlic, butter, salt, and pepper. Lay salmon on one sheet of foil and fold edges up so that the salmon is surrounded and the mixture won’t fall out. Lay asparagus on the other sheet of foil. Spray both with cooking spray. Pour ¾ of sauce mixture on the salmon and the remaining ¼ on the asparagus. Add parsley on top of both asparagus and salmon Cook for 20-25 minutes or until salmon is cooked all the way through. Carefully unwrap each sheet of foil and let cool before eating.", "category": "dinner", "macros": {"calories": 630, "protein": 37, "carbs": 30, "fat": 35}}, {"id": "671fa0c43cd8c723b6b94061", "title": "Healthier Baked Ziti", "ingredients": ": 8 oz ziti noodles (100% whole wheat) 1.5 lbs. ground beef 3 cups Primal Kitchen Marinara sauce 1/2 cup cottage cheese (low fat) 4 oz reduced fat mozzarella cheese 1 egg 1 tbsp olive oil 1 tbsp Italian seasoning 1 tsp minced garlic, salt, and pepper", "directions": ": Cook pasta according to package directions. While pasta is cooking, heat olive oil in a skillet. Add garlic and sauté for 1 minute. Add ground beef and seasonings to skillet and cook until done. Pre-heat oven to 375 and spray a casserole dish with cooking spray. In a large mixing bowl, add ground beef, pasta, 2 cups marinara, half of the mozzarella, cottage cheese, and egg. Add ½ cup of marinara to the bottom of the casserole dish and spread with a spoon. Then, add in the contents of the mixing bowl to dish. Top dish with another ½ cup of marinara and remaining cheese. Bake for 25 minutes.", "category": "dinner", "macros": {"calories": 600, "protein": 42, "carbs": 30, "fat": 35}}, {"id": "6733ab54bdf92b6343913a92", "title": "Chipotle Chicken Pasta", "ingredients": ": 300g pasta shells 12oz chicken breast 1 cup arugula 14 cherry tomatoes halved Sauce ingredients: 1 cup cottage cheese 1.5oz Parmigiano Reggiano 1-2 chipotle peppers in adobe sauce 1 tablespoon of the adobe sauce 4oz fat free evaporated milk", "directions": ": Preheat oven to 400°F. Season chicken as desire (salt, pepper, onion powder, garlic powder, paprika) Bake for 20-25 minutes until cooked completely. Let cool, then cut into bite size pieces. Boil water and cook pasta according to packaging. Blend cottage cheese, chipotle peppers, evaporated milk, parmigiano reggiano, salt and pepper until creamy. In a sauce pan, add the arugula, cherry tomatoes, drained cooked pasta, chicken, and sauce. Mix until fully coated. Portion out and enjoy!", "category": "dinner", "macros": {"calories": 550, "protein": 47, "carbs": 30, "fat": 20}}, {"id": "671a6dfa09a73b6316bfaa59", "title": "Chicken Avocado Melt", "ingredients": ": 2 slices Dave's multigrain bread 1/2 avocado 3 oz grilled chicken breast 1 slice mozzarella cheese 1 dash sea salt 1 dash pepper", "directions": ": Toast bread according to preference. Dice avocado into small pieces and sprinkle salt and pepper on the pieces. Once bread is finished toasting, spread avocado onto toast and mash into a jam like consistency. Cook chicken breast according to preference and top with cheese to melt. Place on slice of toast and top with other piece of toast and enjoy!", "category": "dinner", "macros": {"calories": 700, "protein": 47, "carbs": 30, "fat": 35}}, {"id": "671a76f5b84df063894df6c6", "title": "Taco Chicken", "ingredients": ": 2 lb raw chicken breast 2 packets fajita or taco seasoning 1 packet of ranch seasoning", "directions": ": Preheat oven to 375°F. Slice chicken into half inch strips. Put the strips in a bowl and toss them in the fajita and ranch seasonings. Bake for about 20 mins, or until they are cooked completely.", "category": "dinner", "macros": {"calories": 450, "protein": 40, "carbs": 30, "fat": 10}}, {"id": "671a7824627a3a6727d2adc4", "title": "Crockpot BBQ Chicken", "ingredients": ": 2 lb boneless skinless chicken breast 1.5 cups Primal Kitchen BBQ sauce 1/4 cup apple cider vinegar 1/2 tsp onion powder 1/2 tsp garlic powder", "directions": ": In a bowl, mix BBQ sauce, vinegar, onion and garlic powder. Place chicken breasts in the bottom of the crockpot. Pour the sauce over the chicken and cook chicken on high for 2-3 hours or until completely cooked. Shred the chicken once finished cooking.", "category": "dinner", "macros": {"calories": 450, "protein": 40, "carbs": 30, "fat": 10}}, {"id": "671a7db73975d320de6a3bbf", "title": "Crockpot Sante Fe Chicken", "ingredients": ": 20 oz chicken 1 can (14 oz) diced tomatoes 1 can (15 oz) black beans 8 oz frozen corn 1/4 cup cilantro 14 oz chicken broth 1 tsp garlic powder, onion powder, ground cumin, and sea salt 1/2 avocado, sliced (for topping)", "directions": ": Combine all ingredients in a crockpot and cook on low for 8 - 10 hours or on high for 4 to 6 hours. Add avocado slices on top before serving.", "category": "dinner", "macros": {"calories": 600, "protein": 40, "carbs": 30, "fat": 25}}, {"id": "671a7ed526ce9354e2ba50e0", "title": "Lightened Up Green Bean Casserole", "ingredients": ": 1 lb fresh green beans, trimmed and cut into bite-sized pieces 2bsp olive oil 1 small onion, finely chopped 2 cloves garlic, minced 8 ounces mushrooms, sliced 2 tbsp whole wheat flour 1 cup low-sodium vegetable broth 1 cup unsweetened almond milk (or any other milk alternative) Salt and pepper to taste 1 tsp dried thyme 1 cup whole grain breadcrumbs 2 tbsp grated Parmesan cheese (optional) Cooking spray", "directions": ": Preheat the oven: Preheat your oven to 375°F (190°C). Blanch the green beans: Bring a large pot of water to a boil. Add the green beans and cook for 3-4 minutes, then immediately transfer them to a bowl of ice water to stop the cooking process. Drain and set aside. Make the mushroom sauce: In a large skillet, heat the olive oil over medium heat. Add chopped onions and garlic, sautéing until softened. Add sliced mushrooms and cook until they release their moisture and become golden brown. Sprinkle flour over the mushroom mixture and stir well to coat. Cook for 1-2 minutes to remove the raw flour taste. Slowly whisk in the vegetable broth and almond milk. Stir continuously until the mixture thickens. Season with salt, pepper, and dried thyme. Allow the sauce to simmer for a few minutes until it reaches a creamy consistency. Assemble the casserole: Add the blanched green beans to the mushroom sauce, stirring until well coated. Transfer the mixture to a lightly greased baking dish. Prepare the topping: In a small bowl, mix the whole grain breadcrumbs with grated Parmesan cheese (if using). Sprinkle the breadcrumb mixture evenly over the green bean mixture. Bake: Bake in oven for 20-25 minutes or until the top is golden brown and the casserole is bubbling around the edges. Serve: Allow the casserole to cool for a few minutes before serving. Enjoy your healthier green bean casserole! #side #recipes #seasonal #Thanksgiving #casserole #holiday #sidedish #vegetables", "category": "dinner", "macros": {"calories": 400, "protein": 22, "carbs": 30, "fat": 20}}, {"id": "67337a6dcca7572d7d86fa94", "title": "Greek Crockpot Chicken", "ingredients": ": 1 cup Greek yogurt Z est and juice of 1 lemon 1 tsp salt 1 Tbsp minced garlic Optional: 1 Tbsp dill 2 lb boneless skinless chicken breast", "directions": ": Place chicken breasts in the bottom of the crockpot. Mix the Greek yogurt, lemon zest and juice, salt, garlic, and dill in a bowl. Pour half of the marinade over the chicken. Cook on high for 4 hours or low for 6-8 hours. Once done, remove chicken and shred with forks. Drain off all but about 1/2 cup of remaining juices and add your chicken back to the pot. Mix in the remaining marinade and you’ve got yourself a delicious protein packed dish for dinner. Serve with rice, pita bread, sliced cucumber, chopped tomato, sliced red onions, and/or fresh parsley.", "category": "dinner", "macros": {"calories": 550, "protein": 55, "carbs": 30, "fat": 10}}, {"id": "674129555d5bec25d614fbbf", "title": "Buffalo Chicken Meatballs", "ingredients": ": 1 lb ground chicken 2 TBSP chopped parsley 2 TBSP chopped green onion (green portion only) 1 tsp salt 1/2 tsp pepper 1/4 c finely diced celery 1 slice finely crumbled bread or 1/3 c bread crumbs (can opt for gluten free) 1/4 c buffalo sauce chopped green onion (for garnish)", "directions": ": Add ingredients to food processor. Process on low speed until ingredients are well mixed. Roll mixture into twelve balls and place on parchment lined pan. Bake at 400 degrees F for 15-20 minutes. Flip meatballs halfway through cooking time. Top with additional buffalo sauce and green onion.", "category": "dinner", "macros": {"calories": 450, "protein": 40, "carbs": 30, "fat": 10}}, {"id": "67425367d9e5a2196bb9ea19", "title": "3 Ingredient Fish Tacos", "ingredients": ": 24oz Tilapia (6oz per serving) 1 bag tri-color cole slaw 12 small tortillas Optional: squeeze of lime", "directions": ": Pan fry tilapia in cooking oil of choice. Chop/separate fish into small pieces as it cooks. Add fish taco seasoning packet or seasoning of choice. In separate pan, brown cole slaw in cooking oil for 5-10 minutes or until lightly browned. Heat mini tortillas on additional pan until warm. Stuff tortillas with fish and cole slaw. Top with lime juice if desired!", "category": "dinner", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "674322e3f667ab6a16bc3688", "title": "Jack-O-Lantern Stuffed Peppers", "ingredients": ": 4 large bell peppers (any color) 1 cup cooked rice (white, brown, or your choice) 1 lb ground beef 1 medium onion, diced 1 small bell pepper (any color), diced 2 cloves garlic, minced 1 tsp smoked paprika 1 tsp dried oregano 1/2 tsp chili powder (optional, for a kick) Salt and pepper to taste 1 cup shredded cheese (cheddar, mozzarella, or your choice) 1 can (14 oz) diced tomatoes (drained) 2 tbsp olive oil", "directions": ": P reheat your oven to 375°F (190°C). Cut the tops off the large bell peppers and remove seeds and membranes. Lightly brush the insides with olive oil and set them in a baking dish. Heat 1 tbsp olive oil in a large skillet over medium heat. Add the ground beef, breaking it up with a spoon, and cook until browned (about 5 minutes). Add the onion, diced bell pepper, and garlic, cooking until softened (about 3–4 minutes). Stir in the smoked paprika, oregano, chili powder (if using), salt, and pepper. Stir in the cooked rice and drained diced tomatoes. Mix well and cook for 2–3 minutes to let the flavors meld. Taste and adjust seasonings if necessary. Spoon the beef and rice mixture into each bell pepper, packing it firmly but not overfilling. Top each stuffed pepper with a generous sprinkle of shredded cheese. Cover the baking dish with foil and bake for 25 minutes. Remove the foil and bake for an additional 10 minutes, or until the peppers are tender and the cheese is bubbly and golden. Let the stuffed peppers cool slightly before serving. Tips: For extra flavor, add a splash of Worcestershire sauce or soy sauce to the filling. Swap ground beef for turkey or plant-based crumbles for a variation. Make it saucier by mixing 1/4 cup of tomato sauce into the filling before stuffing.", "category": "dinner", "macros": {"calories": 800, "protein": 42, "carbs": 75, "fat": 35}}, {"id": "674346fa8f6d70252188f19b", "title": "Chicken Pad Thai", "ingredients": ": olive oil for cooking 12oz chicken breasts (seasoned with S&amp;P) 1 egg 2 cups mixed veggies (I used water chestnuts, bell peppers, and broccoli) 1 cup edamame 4 oz pad Thai noodles 1 avocado (optional topping) Sauce: 3 TBSP coconut aminos (sub soy sauce &amp; maple syrup) 1 tsp minced ginger 1 TBSP lime juice", "directions": ": Cook chopped chicken in olive oil on low to medium heat in a large pan or wok. Add egg once chicken is cooked partially through. Add mixed veggies and put lid on pan. While vegetables are cooking, add pad Thai noodles to a separate pot of boiling water. Follow instructions on noodle package. When noodles are fully cooked, add to pan and combine. Pour sauce over mixture and toss ingredients to mix. Serve and enjoy!", "category": "dinner", "macros": {"calories": 600, "protein": 40, "carbs": 30, "fat": 25}}], "snack": [{"id": "67282bf843745626ae1771a7", "title": "Protein Bites", "ingredients": ": 1 cup oats 1/3 cup coconut flakes 1/2 cup ground flaxseed 1/2 cup chocolate chips 2 scoop protein powder 1/2 cup peanut butter 1/3 cup honey 1 teaspoon vanilla extract Other fun add ins: chia seeds, dried cherries, m&amp;ms, cinnamon, pumpkin, sunflower seeds, raisins, cocoa powder", "directions": ": 1. Mix wet ingredients in a large bowl. 2. Add dry ingredients and mix until thick dough like consistency. 3. If dough is flakey, add milk 1 TBSP at a time until dough it slightly sticky. 4. Roll into balls. 7. Refrigerate and enjoy!", "category": "snack", "macros": {"calories": 550, "protein": 35, "carbs": 55, "fat": 10}}, {"id": "679a79b5eb43e94cdd6ef650", "title": "Valentine's Protein Bites", "ingredients": ": ½ cup quick oats 1/4 cup ground flaxseed 1 scoop protein powder 1 scoop collagen 1/2 cup peanut butter 1/4 cup honey 1 TBSP unsweetened almond milk (see note) 42g Valentine’s colored M&amp;Ms Other fun add ins: chia seeds, dried cherries, cinnamon, pumpkin, sunflower seeds, raisins, cocoa powder", "directions": ": 1. Mix wet ingredients in a large bowl. 2. Add dry ingredients and mix until thick dough like consistency. 4. Roll into balls. 7. Refrigerate and enjoy! Note: If dough is dry or flakey, add milk 1 TBSP at a time until dough it is slightly sticky.", "category": "snack", "macros": {"calories": 550, "protein": 35, "carbs": 55, "fat": 10}}, {"id": "671f8f148ac1473e3a5c0241", "title": "Protein Oreo Dip", "ingredients": ": 1 cup of plain, nonfat Greek yogurt 1 cup light Cool Whip 2 tbsp sugar free instant vanilla pudding mix 4 Oreo thins", "directions": ": Add Oreos to a bag and crush them. Then, add all the ingredients to a bowl and mix! Pair with graham crackers, pretzels, etc. Enjoy!", "category": "snack", "macros": {"calories": 400, "protein": 30, "carbs": 30, "fat": 10}}, {"id": "67338c006522897e3512798e", "title": "Pumpkin Patch Protein Balls", "ingredients": ": 1/3 c pumpkin puree 1/4 c peanut butter or nut butter 1 tsp vanilla 1 TBSP maple syrup (or honey) 1 serving of vanilla or unflavored protein powder 1/3 c oat flour 2 tsp pumpkin spice 1 TBSP oat milk (add additional if needed) large dark chocolate chips (for pumpkin stem)", "directions": ": 1. Mix wet ingredients in a large bowl. 2. Add dry ingredients and mix until thick dough like consistency. 3. If dough is flakey, add oat milk 1 TBSP at a time until dough it slightly sticky. 4. Roll into balls. 5. (Optional) use a string to make indented lines across ball (in order to give pumpkin look). 6. Top it off with a single chocolate chip for the stem! 7. Refrigerate and enjoy!", "category": "snack", "macros": {"calories": 400, "protein": 35, "carbs": 30, "fat": 10}}, {"id": "674131b9189710215da6ba73", "title": "Caramel Apple Bites", "ingredients": ": 9 Pitted dates 1 Green apple (diced) 1 oz D ark chocolate (melted) 2 Tbsp A lmond butter 1 tsp H imalayan sea salt", "directions": ": Dice apple into small pieces. Pit dates (if not already pitted) Fill each date with one apple piece. Drizzle with melted dark chocolate &amp; almond butter. Sprinkle with sea salt. Place in freezer for 15 minutes. Refrigerate and enjoy!", "category": "snack", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6733804eb7d41c5a31b071b2", "title": "High-Protein Spinach Artichoke Dip", "ingredients": ": 16oz cottage cheese 5.3oz plain fat-free Greek yogurt 5oz frozen spinach (thawed &amp; drained well) 6oz can artichokes (drained &amp; chopped) ½-¾ cup mozzarella cheese ¼ cup parmesan cheese 1 tsp onion powder 1 tsp garlic powder ½ tsp pepper", "directions": ": Preheat oven to 400°F. Thaw and drain spinach &amp; artichokes thoroughly (squeeze out excess liquid). Mix all ingredients together in a bowl. Pour into an 8x8 glass dish (or medium oval pan) and top with extra cheese if desired. Bake for 25 minutes, then broil for 1-2 minutes to get that perfect golden top. Serve with chips or veggies of your choice! Whether it’s for game day or your next gathering, this dip is a crowd-pleaser that’s as healthy as it is delicious!", "category": "snack", "macros": {"calories": 500, "protein": 37, "carbs": 30, "fat": 20}}], "smoothie": [{"id": "671f931d972d0056560d5d54", "title": "Fruity Chia Seed Smoothie", "ingredients": ": 1 cup of frozen strawberries 1 medium frozen banana 1/2 cup plain non-fat Greek yogurt 1 cup unsweetened plain almond milk 1/2 tsp vanilla extract 2 tbsp chia seeds 1 cup frozen mango 100 g frozen blueberries 1 scoop vanilla protein powder", "directions": ": Add all ingredients to a blender. Blend until smooth. Enjoy!", "category": "smoothie", "macros": {"calories": 450, "protein": 50, "carbs": 30, "fat": 10}}, {"id": "671f9dc92238d40e5e4706c7", "title": "Iced Coffee Protein Shake", "ingredients": ": 1 cup unsweetened almond milk 2 cups ice 1 cup cold coffee or cold brew 1 scoop protein powder (chocolate or vanilla) 1 frozen banana", "directions": ": Add all ingredients to a blender. Blend until mixed well.", "category": "smoothie", "macros": {"calories": 400, "protein": 35, "carbs": 30, "fat": 10}}, {"id": "67213f37356f8939d0aada5b", "title": "Green Protein Smoothie", "ingredients": ": 1 banana 1 cup spinach ½ cup non-fat Greek yogurt 1 scoop protein powder ½ cup unsweetened almond milk 1 T honey or maple syrup (optional, for added sweetness) Ice cubes Toppings: coconut flakes, sliced kiwi, muesli (optional)", "directions": ": Blend together banana, spinach, Greek yogurt, protein powder, almond milk, and optional sweetener. Adjust consistency with more almond milk or ice if needed. Pour into glass or bowl. Top with coconut flakes, sliced kiwi, and muesli. Enjoy your green smoothie!", "category": "smoothie", "macros": {"calories": 450, "protein": 50, "carbs": 30, "fat": 10}}, {"id": "6733657390952d64c3856f78", "title": "Berry Blast Smoothie", "ingredients": ": ½ banana ½ frozen mixed berries ½ cup spinach ½ cup non-fat Greek yogurt 1 scoop protein powder ½ cup unsweetened almond milk 1 T honey or maple syrup (optional, for added sweetness)", "directions": ": Blend together banana, berries, spinach, Greek yogurt, protein powder, almond milk, and optional sweetener. Adjust consistency with more almond milk or add ice if needed. Pour into glass and enjoy!", "category": "smoothie", "macros": {"calories": 450, "protein": 50, "carbs": 30, "fat": 10}}, {"id": "675a1e9d8c4fee71a92a88bb", "title": "Gingerbread Shaken Espresso", "ingredients": ": 1/8 tsp ground ginger 1/8 tsp all spice 1 tsp coconut sugar Double espresso Dairy free Ginger bread creamer (as much as the heart desires)", "directions": ": Brew double shot over ginger, all spice, and coconut sugar. Shake mixture in mason jar. Pour over ice. Add Gingerbread creamer!", "category": "smoothie", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "676df20441e1da20f3caeea7", "title": "Peppermint Mocha Smoothie", "ingredients": ": 1 banana frozen 1/3 c frozen cauliflower 1 cup soy milk 1 scoop collagen, unflavored 1/8 tsp peppermint 2 TBSP Cocoa powder, unsweetened (sub chocolate protein) 1 tsp maple syrup 4-5 small ice cubes (or 2 large)", "directions": ": Blend ingredients in blender. Top with peppermint. Pour into festive cup &amp; enjoy. This recipe is gluten and dairy free. To make IBS friendly use a firm banana and remove frozen cauliflower!", "category": "smoothie", "macros": {"calories": 250, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "6728275e5d817503e89fba37", "title": "Pumpkin Smoothie", "ingredients": ": 1/3 frozen banana 1 cup unsweetened oat milk 1/3 cup frozen riced cauliflower ¼ cup pumpkin pure 1 serving vanilla protein powder 2 dates (soaked in hot water for 15 minutes) 1 tsp pumpkin spice 1 TBSP date syrup (for glass)", "directions": ": Blend ingredients until smooth. Spread date syrup on inside of glass. Pour into glass and enjoy.", "category": "smoothie", "macros": {"calories": 550, "protein": 35, "carbs": 75, "fat": 10}}, {"id": "673367b85e834a657680db44", "title": "Peanut Butter Banana Smoothie", "ingredients": ": 1 banana 2 Tbsp natural peanut butter ½ cup non-fat Greek yogurt 1 scoop protein powder (Kion protein) ½ cup unsweetened almond milk 1t Cinnamon (optional) 1 tsp honey or maple syrup (optional, for added sweetness) (not included in Cronometer calculation) For additional calories: add ¼ cup to ½ cup oats (not included in Cronometer calculation)", "directions": ": Blend together banana, peanut butter, Greek yogurt, protein powder, almond milk, and optional ingredients. Adjust consistency with more almond milk or add ice if needed. Pour into glass and enjoy!", "category": "smoothie", "macros": {"calories": 600, "protein": 50, "carbs": 55, "fat": 10}}, {"id": "673374216c1a1808a50a6007", "title": "Tropical Paradise Smoothie", "ingredients": ": ½ cup frozen mango ½ cup frozen pineapple ½ banana ½ cup non-fat Greek yogurt 1 scoop protein powder (Kion protein) ½ cup unsweetened coconut milk 1 tsp honey or maple syrup (optional, for added sweetness) (not included in Cronometer calculation)", "directions": ": Blend together mango, pineapple, banana, Greek yogurt, protein powder, coconut milk, and optional sweetener. Adjust consistency with more almond milk or add ice if needed. Pour into glass and enjoy!", "category": "smoothie", "macros": {"calories": 450, "protein": 50, "carbs": 30, "fat": 10}}, {"id": "6733751d0e06e441e5090d6b", "title": "Chocolate Banana Protein Smoothie", "ingredients": ": 1 banana 1 Tbsp unsweetened cocoa powder ½ cup non-fat Greek yogurt 1 scoop protein powder (Kion protein) ½ cup unsweetened almond milk 1 tsp honey or maple syrup (optional, for added sweetness) (not included in Cronometer calculation)", "directions": ": Blend together banana, cocoa powder, Greek yogurt, protein powder, almond milk, and optional sweetener. Adjust consistency with more almond milk or add ice if needed. Pour into glass and enjoy!", "category": "smoothie", "macros": {"calories": 600, "protein": 50, "carbs": 50, "fat": 15}}, {"id": "6743451182f8de7a51a3e090", "title": "Coffee Date Smoothie", "ingredients": ": 1 small frozen banana 2 dates 1 scoop of ice cubes 1 cup unsweetened almond milk 1 double espresso shot 1 TBSP date syrup (mixed into espresso shot) 2 spoonfuls of coconut yogurt 1 serving collagen powder Cinnamon 1 tsp vanilla Optional: 1 TBSP white miso paste", "directions": ":", "category": "smoothie", "macros": {"calories": 250, "protein": 15, "carbs": 30, "fat": 10}}], "dessert": [{"id": "676f529ea934c9553beee9a5", "title": "Sugar Cookie Matcha Latte", "ingredients": ": 2 tsp (approx 3 g) matcha powder mixed with 35g hot water 140 mL (approx 2/3 c)almond milk 1/2 tsp Almond extract 1/2 tsp vanilla extract 2 tsp Maple syrup Sprinkles (optional for rim)", "directions": ": Heat 35g of water. Combine with 3g (approx 2 tsp) of matcha. Froth or whisk. Add maple syrup, almond extract, and vanilla extract to mixture. Froth or whisk. Scoop ice into sprinkle lined serving cup. Pour milk of choice over ice. Add in matcha mixture. Stir and enjoy.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}, {"id": "6773e6a79d79be40f0b841b5", "title": "Sugar Cookie Protein Balls", "ingredients": ": 2 serving collagen powder 1 serving vanilla protein powder 1/2 tsp all spice 1/2 tsp salt 1/4 c almond flour 1 tsp vanilla extract 1 tsp almond extract 1/4 c almond butter 1 TBSP maple syrup 2 TBSP soy milk Topping: Sprinkles", "directions": ": Mix all ingredients in bowl until thick (cookie dough-like) consistency. Roll into balls. Dip dough balls into sprinkle and cover completely. Store in fridge and enjoy!", "category": "dessert", "macros": {"calories": 550, "protein": 35, "carbs": 50, "fat": 15}}, {"id": "67744e05dbf530080f283fa1", "title": "Sugar Cookie Whip Dip", "ingredients": ": 1/2 cup Coconut Whipped Topping 1 serving plant based vanilla protein powder 1 tsp almond extract Topping: as many sprinkles as the heart desires", "directions": ": Mix coco whip, protein powder, and almond extract in bowl. Top with sprinkles. Dip your favorite cookie or dessert or eat it by the spoonful. Triple the recipe, and it is also a great high protein dessert dip for parties!", "category": "dessert", "macros": {"calories": 550, "protein": 35, "carbs": 50, "fat": 15}}, {"id": "679ce23b73d25c617a51e6e1", "title": "Chocolate Covered Strawberries", "ingredients": ": 1 pint fresh strawberries, washed and dried thoroughly 6-8 oz dark chocolate melting wafers Optional toppings: crushed nuts, shredded coconut Other fun add ins: chia seeds, dried cherries, cinnamon, pumpkin, sunflower seeds, raisins, cocoa powder", "directions": ": 1. Prep: Line a baking sheet with parchment or waxed paper. Place toppings on small plates if using. Melt Chocolate: Using a double boiler or microwave in 30-second intervals, stirring in between, melt the chocolate until smooth. Dip: Hold each strawberry by the stem, dip into the melted chocolate, and twist slightly to remove excess. If using toppings, dip immediately before placing on the baking sheet. Drizzle (Optional): Drizzle leftover chocolate with a fork over the dipped strawberries. Can also opt to use a different chocolate (white or milk) for drizzle. Set: Chill in the refrigerator for about 15 minutes until the chocolate hardens. Enjoy! Store in a cool place and enjoy within 24 hours for the best taste.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}, {"id": "67d18ee4aa74ea1ca1d57104", "title": "Harissa Roasted Chicken & Sweet Potatoes", "ingredients": ": 2 lb. boneless skinless chicken thighs Kosher salt &amp; black pepper 3 Tbsp. harissa Juice of ½ lemon 2 cloves garlic, minced 3 large sweet potatoes, sliced 1 red onion, sliced 2 Tbsp. olive oil 1 tbsp. ground cumin Fresh cilantro &amp; lemon wedges for serving", "directions": ": Season chicken with salt &amp; pepper. Mix with harissa, lemon juice, and garlic. Let sit. Toss sweet potatoes &amp; onion with oil, cumin, salt &amp; pepper. Spread on a baking sheet &amp; bake at 425°F for 10-15 min. Nestle chicken into the veggies &amp; bake for another 20-25 min until chicken reaches 165°F. Top with cilantro &amp; serve with lemon wedges.", "category": "dessert", "macros": {"calories": 600, "protein": 40, "carbs": 60, "fat": 10}}, {"id": "682c978992d64461b5f10edf", "title": "High Protein Chocolate Mousse", "ingredients": ": 1 container (16oz) cottage cheese 2% fat 1 scoop chocolate protein powder 2 TBSP unsweetened cocoa powder ¼ cup semi sweet chocolate chips, melted", "directions": ": In a food processor or blender, combine all ingredients until smooth. Make sure chocolate chips are melted prior to mixing.", "category": "dessert", "macros": {"calories": 650, "protein": 42, "carbs": 50, "fat": 25}}, {"id": "671f9486a023e60e8f1d53f8", "title": "Sweet Potato Hash", "ingredients": ": 2 medium sweet potatoes, cut into cubes (3 cups) 2 tbsp olive oil ½ tsp ground cumin ½ tsp chili powder ¼ tsp sea salt 1 can of black beans, drained and rinsed 2 tsp lime juice 1 tsp pepper ¼ cup chopped cilantro", "directions": ": Preheat oven to 400℉. Prepare a baking sheet. In a large bowl, add 1 tbsp olive oil, cumin, chili powder, and salt. Mix. Add in sweet potatoes and toss until they are coated. Place sweet potatoes on the baking sheet and bake for 25 minutes or until tender. When the sweet potatoes have 5 minutes remaining, add black beans, 1 tsp lime juice, and 1 tbsp olive oil to a medium sized skillet. Mix and let saute for 5 minutes. Add sweet potatoes and other tsp of lime juice to the skillet. Stir to combine. Add cilantro on top. Let it heat for 3 more minutes and enjoy!", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 60, "fat": 10}}, {"id": "671f9ba44cae162e91ae4e91", "title": "Homemade Sweet Potato Fries", "ingredients": ": 32 oz sweet potato 1 tbsp olive oil 1 tsp garlic powder 1 tsp sea salt 1 tsp pepper", "directions": ": Preheat the oven to 400°F. Cut the sweet potatoes into sticks (1/4 to 1/2 inch wide and 3 inches long) and toss them with the oil. Mix the spices in a small bowl. Toss sweet potatoes in spices. Spread fries out on a baking sheet. Bake for 15 minutes, then flip and finishing cooking for 10 minutes.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 60, "fat": 10}}, {"id": "67314281cb2f703290f4f7c9", "title": "Sweet Potato Nachos", "ingredients": "2 large sweet potatoes 1 lb 95% lean ground beef 1 pack of taco seasoning 2 oz low fat cheese (dairy free or regular) 1 c chopped peppers ½ chopped white onion + 1 TBSP olive oil to cook (optional) Toppings 1 avocado (diced) ½ c shredded lettuce", "directions": ": 1. Slice sweet potatoes into thin rounds and place evenly on baking sheet. 2. Cook sweet potatoes for 25-30 minutes (or until browned) at 400 degrees F. 3. While sweet potatoes are in oven, (add olive oil and onion to skillet), then add ground beef into onions to cook. Season with taco seasoning of choice 4. Take sweet potato out of oven. 5. Spread ground beef, cheese, and peppers evenly over sweet potato thins. 6. Cook in oven for 5 additional minutes to melt cheese. 7. Take out of oven and add into serving dishes. 8. Top with diced avocado and lettuce. For individuals with IBS, omit onions and choose a taco seasoning without onion or garlic powder. Low amounts of red, yellow, and orange bell peppers are generally low FODMAP. Choose green bell peppers in larger amounts for a low FODMAP choice as well.", "category": "dessert", "macros": {"calories": 900, "protein": 42, "carbs": 60, "fat": 50}}, {"id": "67339747901ed647bb3bdfef", "title": "Frozen Greek Yogurt Bark", "ingredients": ": ½ cup non-fat Plain Greek Yogurt ¼ cup strawberries, sliced 1.5 Tbsp granola", "directions": ": Spread Greek yogurt on parchment paper Add sliced strawberries Add granola Freeze until yogurt is firm Remove from freezer, and break into pieces Enjoy!", "category": "dessert", "macros": {"calories": 400, "protein": 30, "carbs": 30, "fat": 10}}, {"id": "67412ff4dd2b075c5744fc6c", "title": "High Protein Chocolate Pudding", "ingredients": ": 5 oz tofu 1/4 c unsweetened almond milk 1 TBSP Cacao 1 TBSP PB powder 1/2 serving vanilla protein of choice 1 tsp maple syrup or date syrup dark chocolate shavings (for topping)", "directions": ": Add ingredients to a food processor. Blend until smooth. Serve in a small dish and top with your favorite topping!", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}, {"id": "67423dbb3451365d324d623d", "title": "High Protein Peanut Butter Cookie Dough", "ingredients": ": 1 container nonfat vanilla Greek yogurt (~4-5oz) (can opt for dairy free yogurt) 1/4 c PB Fit powder 1/4-1/2 c oat flour (add additional depending on consistency) 1-2 servings of protein powder or collagen (add additional depending on consistency) 2 TBSP dairy free chocolate chips", "directions": ": Mix ingredients together until desired consistency, adding extra flour or protein powder as needed. Store in fridge and enjoy throughout the week.", "category": "dessert", "macros": {"calories": 650, "protein": 50, "carbs": 50, "fat": 15}}, {"id": "674d2756538d2a6a09754de5", "title": "Bone Broth Hot Chocolate", "ingredients": ": 1 cup bone broth 2 TBSP unsweetened cocoa 1 TBSP maple syrup (sub two packets stevia) 1/2 cup soy milk (sub fat free milk) 1/2 tsp cinnamon 2 oz marshmallows (optional) peppermint stick (optional)", "directions": ": Heat bone broth, cocoa, maple syrup, soy milk, and cinnamon in a pot on low, stirring to mix ingredients and keep from burning. Top with marshmallows and toss in a peppermint stick for a festive flavor!", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}, {"id": "674e032bd616f449d03820f8", "title": "Peppermint Chocolate Mousse Parfait", "ingredients": ": 1 container vanilla yogurt (sub high protein dairy free yogurt) 1 scoop chocolate protein powder (sub cocoa powder) 1/8 tsp peppermint extract Toppings Gluten Free peppermint Joe Joes (Trader Joes) Smashed peppermint", "directions": ": Mix peppermint extract, yogurt, and chocolate protein powder in one bowl. Top with smashed peppermint cookies and peppermint", "category": "dessert", "macros": {"calories": 550, "protein": 35, "carbs": 50, "fat": 15}}, {"id": "675741f1d52e241947ff8664", "title": "Candy Cane Crunch Cake", "ingredients": ": 1 Rice cake 1 Tbsp Nut butter of choice 2 tsp hemp seeds 11g dark chocolate 1 crushed peppermint", "directions": ": Cover rice cake with nut butter. Sprinkle hemp seeds over nut butter. Dip in melted dark chocolate. Sprinkle crushed peppermint on top of melted chocolate. Freeze for 10 minutes.", "category": "dessert", "macros": {"calories": 650, "protein": 15, "carbs": 95, "fat": 15}}, {"id": "671a79af210b270fc64758f6", "title": "Ground Turkey Sweet Potato Bake", "ingredients": ": 1 lb ground turkey 2 medium sweet potatoes, peeled and diced 2 zucchini, diced 2/3 cup shredded parmesan cheese 1 tsp garlic powder 1 tsp rosemary 5 tbsp olive oil 1/4 tsp salt and pepper", "directions": ": Preheat oven to 400°F. Place in a large baking dish and toss the diced sweet potatoes with 2 tbsp olive oil, 1/2 tsp garlic powder, 1/2 tsp rosemary, salt, and pepper. Bake the sweet potatoes for 30 minutes. While sweet potatoes are in the oven, sauté the ground turkey in a pan with 1 tbsp olive oil, 1 tsp garlic powder, 1/2 tsp rosemary, salt, and pepper. Remove the sweet potato from the oven. Layer the ground turkey and diced zucchini on top of the sweet potatoes. Bake for 10 minutes. Add in an additional 2 tbsp olive oil, mix, and top with the shredded parmesan cheese. Bake for 10 minutes.", "category": "dessert", "macros": {"calories": 550, "protein": 22, "carbs": 60, "fat": 20}}, {"id": "671a82c7b84df06389521851", "title": "Sweet Potato Casserole with Pecan Topping", "ingredients": ":", "directions": ": Preheat the Oven: Preheat your oven to 375°F (190°C). Cook Sweet Potatoes: Place the sweet potato cubes in a large pot of water and bring to a boil. Cook until the sweet potatoes are tender, about 15-20 minutes. Drain the sweet potatoes and transfer them to a large mixing bowl. Mash Sweet Potatoes: Mash the sweet potatoes with a potato masher or fork until smooth. Add Ingredients to the Filling: Add beaten egg, coconut oil, maple syrup (or honey), cinnamon, nutmeg, almond milk, vanilla extract, and a pinch of salt to the mashed sweet potatoes. Mix well until combined. Prepare the Pecan Topping: In a separate bowl, combine chopped pecans, whole wheat flour, melted coconut oil, maple syrup (or honey), cinnamon, and a pinch of salt. Mix until the pecans are evenly coated. Assemble the Casserole: Transfer the sweet potato mixture to a baking dish, spreading it evenly. Add Pecan Topping: Sprinkle the pecan topping evenly over the sweet potato layer. Bake: Bake in oven for 25-30 minutes, or until the pecan topping is golden brown. Serve: Allow the casserole to cool for a few minutes before serving. #side #recipes #seasonal #Thanksgiving #casserole #holiday #holidaymeal", "category": "dessert", "macros": {"calories": 300, "protein": 15, "carbs": 30, "fat": 10}}, {"id": "671a836d6c3dbc11dcf3f49c", "title": "Apple Crisp Crumble", "ingredients": ": Apple Portion: 6 apples 1 tbsp cinnamon dash of salt 2 tsp coconut oil Crumble Portion: 2/3 cup oats 2/3 cup pecans 1 tbsp coconut oil 2 tsp honey", "directions": ": Preheat oven to 350°F. Chop the apples and saut é them along with cinnamon, salt, and coconut oil in a pan at medium high heat for 2-3 minutes. In a food processor, mix all crumble ingredients with 1 tbsp of water until throughly combined. Add crumble and apple mixture to a small baking pan and bake for 15-20 minutes.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 55, "fat": 10}}, {"id": "6741c94ef50079330b1181a8", "title": "Chocolate Chip Pumpkin Bread", "ingredients": ": Wet Ingredients: 1 cup organic pumpkin purée 1/3 cup maple syrup 1/4 cup coconut oil 1 tsp vanilla extract 3 eggs 1/3 cup creamy almond butter (or cashew butter for sweeter taste) Dry Ingredients: 1 tbsp pumpkin spice 1/4 cup almond flour 3 tbsp oat flour 1 tsp baking soda 1/2 tsp salt 1 scoop unflavored collagen 1/4 cup chocolate chips", "directions": ": Mix wet ingredients. Mix dry ingredients in separate bowl. Add dry ingredients into wet ingredients. Mix thoroughly. Pour mixture into parchment lined loaf pan. Sprinkle (or mix in) chocolate chips. Bake for 35-45 minutes on 350 or until fully cooked.", "category": "dessert", "macros": {"calories": 450, "protein": 15, "carbs": 50, "fat": 15}}], "meal_prep": []}}